import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Затишні будинки для відпочинку у Рахівському районі Карпат | Мої Карпати",
  description:
    "Шукаєте ідеальний будинок для відпочинку у Рахівському районі? У нас ви знайдете затишні варіанти для комфортного проживання серед карпатської природи. Насолоджуйтесь гірськими пейзажами, чистим повітрям і гостинністю місцевих жителів. Забронюйте свій ідеальний будинок для відпочинку вже сьогодні!",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/zakarpatska"}
        raion={"/rakhiv-raion"}
        city={""}
        building={"/house"}
      />
      <RealtyItems
        firstFilter={[
          { title: "Будиночки у Рахівському районі" },
          { raion: "/rakhiv-raion", type: "house" },
        ]}
        secondFilter={[
          { title: "Житло у Рахівському районі" },
          { raion: "/rakhiv-raion" },
        ]}
        thirdFilter={[
          { title: "Житло у Закарпатській області" },
          { oblast: "/zakarpatska" },
        ]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Обираючи будинок для відпочинку, ви отримуєте можливість повністю
        насолодитися природою, не відмовляючи собі у зручностях. Ці будинки
        часто обладнані сучасними зручностями: просторими кімнатами, комфортними
        спальнями та кухнями, де ви зможете приготувати смачні страви з місцевих
        продуктів. Усе це створює ідеальні умови для відпочинку з родиною чи
        друзями. У Рахівському районі доступні різноманітні будинки для
        відпочинку, які задовольнять навіть найвибагливіших туристів. Ви можете
        вибрати сучасний котедж з усіма зручностями або зупинитися в
        традиційному дерев'яному будинку, що занурить вас у атмосферу
        автентичності. Багато з них розташовані в живописних місцях, з
        панорамними вікнами, що відкривають захоплюючі краєвиди на гірські
        схили. Якщо ви хочете поринути в автентичний досвід, розгляньте
        можливість зупинки у приватній садибі. Тут ви зможете не лише
        насолодитися комфортом, але й скуштувати традиційні гуцульські страви,
        приготовані з любов’ю. Багато господарів пропонують організовані
        екскурсії, що дозволяють дізнатися більше про культуру та побут місцевих
        жителів.
      </p>
    </RealtyPage>
  );
}
