import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Затишний відпочинок у котеджі в Івано-Франківській області: насолоджуйтесь природою Карпат",
  description:
    "Плануйте незабутній відпочинок у котеджі в Івано-Франківській області! Відчуйте комфорт та насолоду природою серед чудових карпатських пейзажів.",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/ivano-frankivska"}
        raion={""}
        city={""}
        building={"/cottage"}
      />
      <RealtyItems
        firstFilter={[
          { title: "Котеджі в Івано-Франківській області" },
          { oblast: "/ivano-frankivska", type: "cottage" },
        ]}
        secondFilter={[
          { title: "Житло у Івано-Франківській області" },
          { oblast: "/ivano-frankivska" },
        ]}
        thirdFilter={[]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Котеджі в Івано-Франківській області: затишок Карпат у вашому
        розпорядженні. Івано-Франківщина – це справжній рай для тих, хто прагне
        відпочити від міської суєти та насолодитися красою природи. А оренда
        котеджу в Карпатах – це відмінний спосіб зробити ваш відпочинок
        незабутнім. Чому варто обрати котедж в Івано-Франківській області?
        Самостійність: Котедж забезпечує повну свободу та приватність. Ви можете
        готувати їжу, відпочивати на терасі, насолоджуватися тишею гір. Комфорт:
        Сучасні котеджі обладнані всіма необхідними зручностями: кухнею,
        санвузлом, затишною вітальнею, часто є камін. Природа: Карпати – це
        дивовижна природа, яка зачаровує своєю красою. Ліси, гори, річки – все
        це створює унікальну атмосферу для відпочинку. Активний відпочинок:
        Багато котеджів розташовані поблизу туристичних маршрутів, гірськолижних
        трас, озер. Ви можете займатися пішими прогулянками, кататися на
        велосипеді, рибалити, а взимку – насолоджуватися зимовими видами спорту.
        Гастрономія: Смачна домашня кухня з використанням місцевих продуктів
        доповнить ваш відпочинок незабутніми смаковими враженнями.
      </p>
    </RealtyPage>
  );
}
