import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Комфортне житло в Берегівському районі: ідеальне місце для відпочинку | Мої Карпати",
  description:
    "Знайдіть ідеальне житло в Берегівському районі, де кожен момент наповнений комфортом і затишком. Від класичних садиб до сучасних апартаментів — вибір для будь-якого смаку. Насолоджуйтеся унікальною природою, термальними джерелами та багатою культурною спадщиною регіону. Тут ви зможете провести незабутній відпочинок, сповнений нових вражень і релаксації!",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/zakarpatska"}
        raion={"/berehiv-raion"}
        city={""}
        building={""}
      />
      <RealtyItems
        firstFilter={[
          { title: "Нерухомість у Берегівському районі" },
          { raion: "/berehiv-raion" },
        ]}
        secondFilter={[
          { title: "Житло у Закарпатській області" },
          { oblast: "/zakarpatska" },
        ]}
        thirdFilter={[]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Відпочинок у Берегівському районі: Затишне житло серед природних красот.
        Берегівський район, перлина Закарпаття, зачаровує своєю неповторною
        природою, цілющими термальними джерелами та багатою культурною
        спадщиною. Якщо ви плануєте вікенд чи триваліший відпочинок у цьому
        регіоні, розгляньте різноманітні варіанти житла, що пропонуються. Оренда
        житла в Берегівському районі — це можливість знайти ідеальне місце для
        будь-якого типу відпочинку. Чи це буде сімейна відпустка, романтична
        втеча, чи активний вікенд з друзями, ви зможете вибрати з безлічі
        комфортних варіантів: від традиційних садиб і котеджів до сучасних
        апартаментів і готелів. Однією з ключових переваг цього району є його
        захоплюючі природні пейзажі. Гірські масиви, зелені ліси та спокійні
        річки створюють ідеальні умови для активного відпочинку на свіжому
        повітрі. Ви зможете насолодитися піші прогулянки, велотуризмом,
        риболовлею або просто релаксацією на березі річки, вбираючи в себе красу
        природи. Вибір житла в Берегівському районі — це не лише комфорт, а й
        можливість зануритися в унікальну атмосферу Закарпаття, познайомитися з
        місцевою культурою та традиціями. Незалежно від того, які активності вас
        цікавлять, цей регіон обіцяє безліч вражень і незабутніх моментів.
      </p>
    </RealtyPage>
  );
}
