import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Готелі у Верховинському районі: Ваша відпустка серед карпатських пейзажів | Мої Карпати",
  description:
    "Готелі у Верховинському районі забезпечують комфортний відпочинок серед мальовничих карпатських пейзажів. Обирайте з різноманітних затишних номерів і насолоджуйтеся смачними стравами, активними розвагами та теплом домашнього вогнища. Це ідеальне місце для сімейних подорожей, романтичних вихідних або активного відпочинку з друзями. Відкрийте для себе справжню красу Карпат у комфорті та зручності!",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/ivano-frankivska"}
        raion={"/verkhovyna-raion"}
        city={""}
        building={"/hotel"}
      />
      <RealtyItems
        firstFilter={[
          { title: "Готелі у Верховинському районі" },
          { raion: "/verkhovyna-raion", type: "hotel" },
        ]}
        secondFilter={[
          { title: "Житло у Верховинському районі" },
          { raion: "/verkhovyna-raion" },
        ]}
        thirdFilter={[
          { title: "Житло у Івано-Франківській області" },
          { oblast: "/ivano-frankivska" },
        ]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        У кожному готелі ви знайдете стильні номери, оформлені в традиційному
        карпатському стилі, де тепло дерев’яних елементів і м’яке світло
        створюють ідеальні умови для романтичних вечорів. Уявіть собі вечерю при
        свічках на терасі, під зоряним небом, коли навколо звучить тільки шепіт
        вітру і дзюрчання гірських річок. Дні тут наповнені безмежними
        можливостями для активного відпочинку: прогулянки по живописних стежках,
        катання на лижах у зимовий період або насолодження краєвидами на
        велосипеді. Ви зможете дослідити неповторні природні пам’ятки та
        захоплюючі маршрути, які підходять для пари, що прагне пригод. Верховина
        також відома своїми культурними традиціями. Ви можете відвідати
        етнографічні музеї, насолодитися місцевою кухнею та взяти участь у
        традиційних святкуваннях. Обираючи готелі у Верховинському районі, ви не
        просто отримуєте комфорт, а й створюєте незабутні моменти, які стануть
        основою вашої історії кохання. Це місце, де кожен ранок починається з
        краси природи, а кожен вечір завершується романтичними спогадами під
        зоряним небом.
      </p>
    </RealtyPage>
  );
}
