import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Бази відпочинку в Тячівському районі: Відкрийте красу Закарпаття | Мої Карпати",
  description:
    "Зануртесь у чарівний світ Тячівського району з нашими базами відпочинку! Тут ви знайдете комфортні умови для незабутнього відпочинку в обіймах карпатської природи. Від активних пригод на свіжому повітрі до затишного сімейного відпочинку — у нас є все для вашого ідеального відпочинку. Вибирайте свою оазу спокою та гармонії серед гір уже сьогодні!",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/zakarpatska"}
        raion={"/tyachiv-raion"}
        city={""}
        building={"/base"}
      />
      <RealtyItems
        firstFilter={[
          { title: "Бази відпочинку у Тячівському районі" },
          { raion: "/tyachiv-raion", type: "base" },
        ]}
        secondFilter={[
          { title: "Житло у Тячівському районі" },
          { raion: "/tyachiv-raion" },
        ]}
        thirdFilter={[
          { title: "Житло у Закарпатській області" },
          { oblast: "/zakarpatska" },
        ]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Відпочинок у Тячівському районі: Бази, які надихають на нові враження.
        Тячівський район — це справжня перлина Закарпаття, де природа розкриває
        свої найкращі грані. Якщо ви шукаєте ідеальне місце для відпочинку, бази
        відпочинку в цьому регіоні нададуть вам безліч можливостей для насолоди
        природою та активного проведення часу. Чому варто обрати базу відпочинку
        в Тячівському районі? По-перше, тутешні ландшафти вражають своєю
        різноманітністю. Високі гори, живописні річки та таємничі ліси створюють
        ідеальні умови для любителів активного відпочинку. Від піших походів до
        велосипедних прогулянок — ви зможете дослідити мальовничі маршрути, які
        залишать у вашій пам'яті незабутні враження. По-друге, багато баз
        відпочинку пропонують сучасні зручності та комфорт, що робить ваше
        перебування приємним. Ви можете обрати затишний котедж з усіма
        зручностями, де зможете насолоджуватися вечорами з родиною або друзями.
        Тячівський район також славиться своїми цілющими мінеральними водами та
        термальними джерелами. Ці природні багатства надають можливість не лише
        для релаксації, а й для оздоровлення. Культурне багатство та
        гастрономічні насолоди. Окрім природних красот, Тячівський район вражає
        своїм культурним спадком. Тут ви зможете зануритися в атмосферу
        закарпатських традицій, скуштувати унікальні страви місцевої кухні та
        відвідати різноманітні культурні заходи. Відпочинок у Тячівському районі
        — це можливість не лише відновити сили, а й познайомитися з
        багатогранною культурою та звичаями закарпатців. Кожен момент,
        проведений тут, обіцяє бути насиченим і незабутнім.
      </p>
    </RealtyPage>
  );
}
