import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title: "Житло у Тячівському районі: комфорт та природа Карпат | Мої Карпати",
  description:
    "Оренда житла в Тячівському районі – ідеальний вибір для тих, хто хоче зануритися в атмосферу Карпат, відпочити в затишку та комфорті. Свіже гірське повітря та неймовірні пейзажі забезпечать вам незабутні враження.",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/zakarpatska"}
        raion={"/tyachiv-raion"}
        city={""}
        building={""}
      />
      <RealtyItems
        firstFilter={[
          { title: "Житло в Тячівському районі" },
          { raion: "/tyachiv-raion" },
        ]}
        secondFilter={[
          { title: "Житло у Закарпатській області" },
          { oblast: "/zakarpatska" },
        ]}
        thirdFilter={[]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Тячівський район Закарпатської області – це неповторний куточок Карпат,
        де природа зачаровує своєю первозданною красою. Обираючи житло тут, ви
        відкриваєте для себе можливість комфортного відпочинку у самому серці
        гір, серед густих лісів та стрімких річок, де кожен момент наповнений
        спокоєм та гармонією. Житлові варіанти в Тячівському районі вражають
        різноманітністю: від затишних дерев’яних будиночків до просторих
        котеджів з усіма сучасними зручностями. Незалежно від того, чи шукаєте
        ви місце для сімейного відпочинку або романтичного вікенду, тут
        знайдеться ідеальний варіант. Багато об'єктів нерухомості оснащені
        власними кухнями, терасами з краєвидом на гори, а також зонами
        відпочинку з мангалами, що створює неповторну атмосферу домашнього
        затишку в горах. Тячівський район також приваблює любителів активного
        відпочинку. Тут доступні безліч можливостей для піших походів,
        велосипедних маршрутів, риболовлі чи зимових видів спорту. Обравши житло
        в цьому регіоні, ви не лише отримуєте комфортне місце для проживання, а
        й можливість досліджувати незаймані природні куточки Карпат, створюючи
        яскраві спогади, які залишаться з вами назавжди.
      </p>
    </RealtyPage>
  );
}
