import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Ваше місце відпочинку: будиночки в Берегівському районі Закарпаття | Мої Карпати",
  description:
    "Вітаємо вас на нашому сайті, де ви знайдете ідеальні будиночки для відпочинку в Берегівському районі! Пропонуємо широкий вибір затишних і комфортних варіантів, що ідеально підходять для сімейних подорожей, романтичних вихідних або відпочинку з друзями. Наші будиночки розташовані в живописних куточках Закарпаття, де ви зможете насолодитися красою природи та спокоєм. Кожен з наших об’єктів обладнаний сучасними зручностями, щоб забезпечити вам комфортний відпочинок. Відкрийте для себе активні види відпочинку — піші прогулянки, гастрономічні екскурсії та багато іншого. Обирайте наші будиночки для незабутніх вражень у серці Закарпаття!",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/zakarpatska"}
        raion={"/berehiv-raion"}
        city={""}
        building={"/house"}
      />
      <RealtyItems
        firstFilter={[
          { title: "Будинки у Берегівському районі" },
          { raion: "/berehiv-raion", type: "house" },
        ]}
        secondFilter={[
          { title: "Житло у Мукачівському районі" },
          { raion: "/berehiv-raion" },
        ]}
        thirdFilter={[
          { title: "Житло у Закарпатській області" },
          { oblast: "/zakarpatska" },
        ]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Берегівський район — це одна з найчарівніших перлин Закарпаття, що
        вабить туристів своїми мальовничими пейзажами, багатою культурною
        спадщиною та традиціями. Якщо ви мрієте про затишний відпочинок у
        живописному куточку природи, де можна насолодитися гармонією і спокоєм,
        будиночки в Берегівському районі стануть ідеальним вибором. Цей регіон
        славиться цілющими термальними водами, що робить його безумовно
        привабливим місцем для відновлення сил та релаксації. Численні сучасні
        SPA-комплекси і курорти, розташовані неподалік, надають можливість
        насолодитися розкішними лікувальними процедурами та відпочинком у теплих
        термальних джерелах. Затишні будиночки в Берегівському районі пропонують
        різноманітні варіанти проживання — від традиційних дерев’яних хатинок до
        стильних сучасних котеджів. Вони ідеально підходять для сімейного
        відпочинку, романтичних вихідних або веселих зустрічей з друзями. Кожен
        з них обладнаний усім необхідним для комфортного проживання, включаючи
        затишні кухні, де можна приготувати смачні страви. Однією з основних
        переваг відпочинку в Берегівському районі є можливість активного
        дозвілля. Ви можете займатися піший туризмом, велоспортом або
        риболовлею. У навколишніх краєвидах розташовані численні мальовничі
        маршрути, які ведуть до захопливих водоспадів та величних гірських
        вершин. Для тих, хто цінує гастрономічні враження, Берегівський район
        пропонує справжнє кулінарне свято. Місцева кухня вражає різноманіттям
        смаків і ароматів, зокрема традиційними угорськими стравами, які можна
        спробувати в затишних ресторанах. Відпочинок у будиночках Берегівського
        району — це не лише можливість насолодитися красою природи, але й шанс
        зануритися в яскраву місцеву культуру та традиції. Якщо ви плануєте свою
        наступну незабутню подорож, обирайте цей чарівний регіон для вражаючого
        відпочинку!
      </p>
    </RealtyPage>
  );
}
