import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title: "Незабутній відпочинок у котеджах Берегівського району | Мої Карпати",
  description:
    "Ласкаво просимо на наш сайт, присвячений затишним котеджам у Берегівському районі! Тут ви знайдете широкий вибір комфортабельних котеджів, які ідеально підходять для сімейних подорожей, романтичних вихідних або активного відпочинку з друзями. Наші котеджі розташовані в живописних місцях Закарпаття, де ви зможете насолодитися красою природи, чистим повітрям і спокоєм. Кожен котедж обладнаний усім необхідним для комфортного проживання, а також має можливості для активного дозвілля, такі як піші прогулянки, велопрогулянки та гастрономічні екскурсії. Обирайте наші котеджі для незабутніх моментів і вражень у серці Закарпаття!",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/zakarpatska"}
        raion={"/berehiv-raion"}
        city={""}
        building={"/cottage"}
      />
      <RealtyItems
        firstFilter={[
          { title: "Котеджі у Берегівському районі" },
          { raion: "/berehiv-raion", type: "cottage" },
        ]}
        secondFilter={[
          { title: "Житло у Берегівському районі" },
          { raion: "/berehiv-raion" },
        ]}
        thirdFilter={[
          { title: "Житло у Закарпатській області" },
          { oblast: "/zakarpatska" },
        ]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Берегівський район — це справжня скарбниця Закарпаття, що вражає
        туристів своєю неймовірною природною красою та багатством культурних
        традицій. Якщо ви шукаєте затишне місце для відпочинку, котеджі в
        Берегівському районі стануть ідеальним вибором для вашої наступної
        подорожі. Цей регіон славиться цілющими термальними водами, які
        привертають туристів з різних куточків України та світу. Численні
        сучасні SPA-комплекси та курорти в околицях забезпечують можливість
        насолодитися розкішними процедурами та відновити сили в теплих
        термальних джерелах, що робить відпочинок ще більш комфортним і
        приємним. Котеджі в Берегівському районі пропонують широкий вибір
        житлових варіантів — від традиційних дерев'яних хаток до стильних
        сучасних будинків. Вони ідеально підходять для сімейних відпусток,
        романтичних вихідних або веселих зустрічей з друзями. У кожному котеджі
        вас чекатимуть всі необхідні зручності для комфортного проживання, що
        дозволить вам відчути себе як удома. Переваги відпочинку в Берегівському
        районі не обмежуються тільки комфортом. Ви зможете активно провести час
        на свіжому повітрі, насолоджуючись пішею прогулянкою, велопоїздками або
        риболовлею. Величезна кількість мальовничих маршрутів відкриває доступ
        до дивовижних природних пам'яток і незабутніх краєвидів. Не менш
        вражаючою є і місцева кухня, яка потішить вас різноманіттям смаків.
        Традиційні угорські страви, приготовані з натуральних продуктів, можна
        спробувати в затишних ресторанах і кафе, що надасть вам можливість
        відчути справжній смак Закарпаття. Відпочинок у котеджах Берегівського
        району — це не лише можливість насолодитися природними красотами, але й
        шанс поринути в яскраву місцеву культуру та її традиції. Обирайте цей
        дивовижний регіон для своєї наступної подорожі, щоб створити незабутні
        спогади та відновити внутрішню гармонію!
      </p>
    </RealtyPage>
  );
}
