import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Бази відпочинку в Карпатах | Бази відпочинку є популярними серед туристів, які шукають можливості для активного відпочинку.| Мої Карпати",
  description:
    "Відкрийте для себе незабутній відпочинок на базах у горах, де комфорт поєднується з природною красою! Бази відпочинку пропонують затишні котеджі, смачну кухню та широкий спектр активностей, від катання на лижах до піших прогулянок. Насолоджуйтеся свіжим гірським повітрям і мальовничими пейзажами. Ідеальне місце для сімейного відпочинку або активних пригод на природі! Забронюйте свій відпочинок вже сьогодні!",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty oblast={""} raion={""} city={""} building={"/base"} />
      <RealtyItems
        firstFilter={[
          { title: "Бази відпочинку в Карпатах" },
          { type: "base" },
        ]}
        secondFilter={[]}
        thirdFilter={[]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Бази відпочинку в Карпатах — це ідеальне місце для поєднання релаксації
        з активним відпочинком. Карпатський регіон приваблює туристів завдяки
        своїм мальовничим горам, чистим річкам і повітрю, наповненому ароматами
        соснових лісів. Тут кожен може знайти для себе ідеальний варіант
        відпочинку, незалежно від пори року та уподобань. На базах відпочинку в
        Карпатах є широкий вибір послуг та умов для проживання: від розкішних
        готелів з басейнами та СПА до затишних дерев'яних котеджів або
        екологічних будиночків. Це дозволяє кожному вибрати варіант, що
        відповідає бюджету та потребам. Багато баз спеціалізуються на оздоровчих
        програмах, пропонуючи сауни, чани з гарячою водою та масажі. Активний
        відпочинок — одна з головних переваг Карпат. Взимку популярні
        гірськолижні курорти Буковель та Драгобрат, а в теплі місяці
        відпочивальники можуть займатися пішими походами, велотуризмом,
        рафтингом або катанням на конях. Місцеві бази організовують екскурсії до
        визначних місць, таких як водоспади, гірські озера та старовинні
        гуцульські церкви. Карпатська кухня — ще один приємний бонус. На базах
        можна скуштувати традиційні страви, такі як банош, деруни, гуцульський
        борщ, приготовані з місцевих продуктів, зокрема грибів, ягід та меду.
        Відпочинок у Карпатах — це чудова можливість відновити сили,
        насолодитися природою та відчути справжнє гуцульське гостинність.
      </p>
    </RealtyPage>
  );
}
