import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Будинки у Карпатах | Затишний відпочинок у будиночку серед гірських пейзажів| Мої Карпати",
  description:
    "Шукаєте будинки у Карпатах для комфортного відпочинку? Обирайте з широкого вибору затишних котеджів та будинків серед мальовничих гірських пейзажів. Відчуйте справжню атмосферу Карпат, насолоджуючись чистим повітрям та природою!",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty oblast={""} raion={""} city={""} building={"/house"} />
      <RealtyItems
        firstFilter={[{ title: "Будинки в Карпатах" }, { type: "house" }]}
        secondFilter={[]}
        thirdFilter={[]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Затишні будиночки в Карпатах: відпочинок у гармонії з природою Бажаєте
        втекти від гучного міського життя і поринути в спокійний світ природи? У
        Карпатах вас чекає ідеальне місце для відпочинку, де звуки метушні
        змінюються на мелодію гірських потоків, а сірі будівлі поступаються
        місцем величним лісам. Тут ви знайдете безліч затишних будиночків на
        будь-який смак і бюджет. Вибір такого житла пропонує вам можливість
        насолоджуватися тишею та спокоєм, готувати улюблені страви на власній
        кухні і проводити час з рідними та друзями. Карпати відкривають перед
        вами величезний спектр можливостей для активного відпочинку: взимку
        можна насолоджуватися лижними спусками, а влітку – піші прогулянки,
        велопоїздки або риболовлю. Дерев’яні будиночки, зазвичай з великими
        вікнами, створюють атмосферу затишку і тепла, дозволяючи милуватися
        чудовими гірськими пейзажами. Ви можете зупинитися в традиційних
        карпатських хати, які зберігають унікальний стиль регіону, або обрати
        сучасні котеджі з усіма необхідними зручностями. Для тих, хто прагне
        поєднати відпочинок із оздоровленням, доступні будиночки з басейном або
        сауною. Якщо ви шукаєте щось нове, зверніть увагу на глемпінги – стильні
        варіанти, що забезпечують комфортне перебування на природі. При виборі
        будиночка важливо враховувати сезон: взимку найкраще зупинятися ближче
        до лижних курортів, а влітку – біля водойм. Визначте розмір компанії та
        зверніть увагу на ціну, яка може варіюватись залежно від сезону та рівня
        зручностей. Забронювати житло можна через спеціалізовані веб-сайти або
        безпосередньо у власників. Не відкладаймо вашу мрію про відпочинок у
        Карпатах – знайдіть затишний будиночок і насолоджуйтеся красою природи
        вже сьогодні!
      </p>
    </RealtyPage>
  );
}
