import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title: "Затишні Котеджі Закарпаття – Відпочинок у Серці Карпат| Мої Карпати",
  description:
    "Шукаєте котеджі в Закарпатті? Забронюйте комфортне проживання в самому серці Карпат. Розкішні котеджі з усіма зручностями, поруч із гірськими стежками, термальними водами та історичними пам'ятками.",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/zakarpatska"}
        raion={""}
        city={""}
        building={"/cottage"}
      />
      <RealtyItems
        firstFilter={[
          { title: "Котеджі у Закарпатській області" },
          { oblast: "/zakarpatska", type: "cottage" },
        ]}
        secondFilter={[
          { title: "Все житло у Закарпатській області" },
          { oblast: "/zakarpatska" },
        ]}
        thirdFilter={[]}
        forthFilter={[]}
        fifthFilter={[{ title: "Житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Насолода відпочинком у котеджах Закарпаття: відчуйте затишок Карпат
        Закарпаття – справжній скарб України з його неповторними ландшафтами,
        чистим гірським повітрям і багатою культурною спадщиною. Цей регіон
        ідеально підходить для тих, хто мріє про відпочинок на природі, далеко
        від міського шуму та повсякденних турбот. Оренда котеджу в Карпатах – це
        чудовий спосіб поринути в атмосферу спокою та гармонії. Котеджний
        відпочинок пропонує повну свободу та незалежність. Тут ви самостійно
        плануєте свій день, не залежачи від розкладу готелів чи ресторанів.
        Можна насолоджуватися затишними вечорами біля каміна або проводити час
        на просторій терасі, милуючись панорамними видами Карпат. Дерев’яні
        стіни та натуральні матеріали котеджів створюють особливу атмосферу
        тепла та спокою, яка дарує відчуття дому. Розташування багатьох котеджів
        дає можливість щоденно насолоджуватися чудовими краєвидами гір, річок та
        лісів. Кожен ранок починається з неймовірних пейзажів, які дарують заряд
        енергії та натхнення на весь день. А простора територія біля котеджів
        стане ідеальним місцем для ігор на свіжому повітрі або затишних сімейних
        посиденьок. Кухня в котеджах дозволяє вам готувати улюблені страви,
        насолоджуючись домашнім затишком навіть далеко від дому. Це особливо
        зручно для тих, хто подорожує з дітьми або дотримується спеціальних
        дієт. Відпочинок у котеджі – це не тільки комфорт, але й можливість
        організувати своє дозвілля так, як вам подобається. Додаткові послуги,
        такі як сауна, басейн чи прокат спортивного інвентарю, додають
        різноманітності вашому відпочинку.
      </p>
    </RealtyPage>
  );
}
