import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Відкрийте для себе бази відпочинку в Чернівецькій області: насолода природою та комфортом | Мої Карпати",
  description:
    "Відпочиньте на базах у Чернівецькій області, де злиття комфорту та природи створює ідеальні умови для релаксації. Відкрийте для себе живописні пейзажі, активний відпочинок та смачну кухню, насолоджуючись затишком і автентичністю регіону.",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/chernivetska"}
        raion={""}
        city={""}
        building={"/base"}
      />
      <RealtyItems
        firstFilter={[
          { title: "Бази відпочинку у Чернівецькій області" },
          { oblast: "/chernivetska", type: "base" },
        ]}
        secondFilter={[
          { title: "Житло у Чернівецькій області" },
          { oblast: "/chernivetska" },
        ]}
        thirdFilter={[]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Бази відпочинку в Чернівецькій області: Ваше місце для релаксації серед
        природи Чернівецька область — це справжня перлина заходу України, яка
        приваблює туристів своїми вражаючими пейзажами та багатою культурною
        спадщиною. Якщо ви прагнете втекти від буденності і зануритися в
        атмосферу спокою та краси, бази відпочинку стануть ідеальним вибором.
        Чому варто обрати базу відпочинку в Чернівцях? По-перше, ви отримуєте
        різноманітність у виборі житла. Від затишних дерев’яних котеджів до
        стильних глемпінгів — кожен знайде тут щось до душі. Багато баз оснащені
        сучасними зручностями, а наявність кухні дозволяє приготувати смачні
        страви з використанням місцевих продуктів. По-друге, природні краєвиди
        Чернівецької області вражають. Гірські масиви, густі ліси і чисті річки
        створюють ідеальні умови для активного відпочинку. Ви зможете зайнятися
        пішими прогулянками, катанням на велосипеді, риболовлею, а взимку —
        лижами чи сноубордом. По-третє, відпочинок на базі — це можливість
        ближче познайомитися з місцевими традиціями. Багато баз організовують
        екскурсії, кулінарні майстер-класи та інші цікаві заходи, які допоможуть
        вам дізнатися більше про культуру цього регіону. Досліджуйте Чернівецьку
        область! Обираючи базу відпочинку в Чернівецькій області, ви отримуєте
        можливість поєднати комфорт з близькістю до природи. Тут знайдеться
        місце для активних пригод і спокійних вечорів біля вогнища. Не
        відкладайте — плануйте свою наступну подорож до Чернівців і
        насолоджуйтеся усіма перевагами відпочинку в цій унікальній області!
      </p>
    </RealtyPage>
  );
}
