import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title: "Глемпінги у Дрогобицькому районі | Мої Карпати",
  description:
    "Глемпінги у Дрогобицькому районі – це унікальний формат відпочинку, який поєднує комфорт і близькість до природи. Насолоджуйтесь затишними наметами, оснащеними всіма зручностями, серед захоплюючих карпатських пейзажів. Це ідеальний вибір для тих, хто прагне втілити романтику природи без відмови від сучасного комфорту. Відкрийте для себе нові враження та незабутні моменти в глемпінгах Дрогобиччини!",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/lvivska"}
        raion={"/drohobych-raion"}
        city={""}
        building={"/glamping"}
      />
      <RealtyItems
        firstFilter={[
          { title: "Глемпінги у Дрогобицькому районі районі" },
          { raion: "/drohobych-raion", type: "glamping" },
        ]}
        secondFilter={[
          { title: "Житло у Дрогобицькому районі" },
          { raion: "/drohobych-raion" },
        ]}
        thirdFilter={[
          { title: "Житло у Львівській області" },
          { oblast: "/lvivska" },
        ]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Глемпінги пропонують вам не просто місце для ночівлі — це простір для
        релаксації та насолоди. Затишні ліжка, електрику і навіть приватні ванні
        кімнати забезпечують комфорт, якого прагнуть сучасні мандрівники. У
        спільних зонах можна провести вечір у колі друзів, смакуючи місцеві
        страви, або насолодитися тихими моментами біля вогнища, слухаючи шепіт
        лісу. Дрогобицький район вражає своєю природною красою та різноманіттям
        активностей. Під час прогулянок мальовничими стежками або велосипедних
        турів ви зможете насолодитися вражаючими краєвидами та доторкнутися до
        культури цього регіону, відвідуючи старовинні церкви та музеї. Тут кожен
        знайде своє місце: від тихих прогулянок до захоплюючих пригод. Глемпінги
        у Дрогобицькому районі створюють ідеальні умови для того, щоб ви могли
        віднайти баланс між активним відпочинком і спокоєм. Це шанс зануритися в
        атмосферу, що живить душу, і відчути єдність з природою. Вибираючи
        глемпінг, ви обираєте не просто відпочинок, а можливість створити
        незабутні спогади в компанії близьких, відчуваючи справжнє щастя в
        кожному моменті, проведеному під безмежним небом Карпат.
      </p>
    </RealtyPage>
  );
}
