import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title: "Бази відпочинку у Дрогобицькому районі | Мої Карпати",
  description:
    "Бази відпочинку у Дрогобицькому районі пропонують ідеальне місце для релаксації та відновлення сил серед мальовничих карпатських пейзажів. Ви знайдете затишні умови, широкий спектр послуг та активні розваги для всієї родини. Насолоджуйтеся природою, комфортом і незабутніми моментами у цьому чудовому куточку України!",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/lvivska"}
        raion={"/drohobych-raion"}
        city={""}
        building={"/base"}
      />
      <RealtyItems
        firstFilter={[
          { title: "Бази відпочинку у Дрогобицькому районі районі" },
          { raion: "/drohobych-raion", type: "base" },
        ]}
        secondFilter={[
          { title: "Житло у Дрогобицькому районі" },
          { raion: "/drohobych-raion" },
        ]}
        thirdFilter={[
          { title: "Житло у Львівській області" },
          { oblast: "/lvivska" },
        ]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        На базах вас чекають комфортні номери, оформлені з любов’ю та увагою до
        деталей. Кожен ранок тут розпочинається з легкого ароматного сніданку,
        після якого можна вийти на свіже повітря, де чекають незабутні пригоди.
        Серед дерев і гір ви відчуєте себе частиною природи, занурившись у її
        красу. Прогулянки мальовничими стежками, захоплюючі велосипедні тури та
        екскурсії до історичних пам’яток наповнять ваш відпочинок новими
        враженнями. Ви зможете відвідати старовинні церкви, помилуватися
        природними резервуарами та насолодитися безкрайніми панорамами, які
        залишать у вашій пам’яті яскраві спогади. Бази відпочинку у
        Дрогобицькому районі — це не лише комфорт і зручності, але й можливість
        створити незабутні моменти в колі родини та друзів. Це місце, де природа
        надихає, а кожен день приносить нові емоції. Виберіть свою базу і
        відчуйте, як серце наповнюється радістю, а душа — спокоєм, адже тут, у
        серці Карпат, здійснюються найсміливіші мрії про відпочинок!
      </p>
    </RealtyPage>
  );
}
