import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Житло у Івано-Франківській області | Тут можна знайти варіанти житла в Івано-Франківській області| Мої Карпати",
  description:
    "Житло в Івано-Франківській області: комфортні котеджі, готелі та садиби для вашого відпочинку в Карпатах. Насолоджуйтесь красивими пейзажами, активними розвагами та місцевою культурою.",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/ivano-frankivska"}
        raion={""}
        city={""}
        building={""}
      />
      <RealtyItems
        firstFilter={[
          { title: "Житло в Івано-Франківській області" },
          { oblast: "/ivano-frankivska" },
        ]}
        secondFilter={[]}
        thirdFilter={[]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Житло в Івано-Франківській області — це відмінний вибір для тих, хто
        прагне зануритися в красу Карпат. Цей регіон славиться своєю дивовижною
        природою, багатою культурною спадщиною та щирою гостинністю місцевих
        жителів. Ви можете обрати з різноманітних варіантів проживання: від
        стильних готелів і комфортабельних котеджів до традиційних гуцульських
        садиб, які створюють атмосферу домашнього затишку. Серед найвідоміших
        туристичних місць Івано-Франківської області — Національний природний
        парк "Сколівські Бескиди", який пропонує безліч маршрутів для піших
        прогулянок і велоезда. Тут ви знайдете мальовничі водоспади, чисті
        гірські річки та вражаючі панорами, які не залишать байдужим жодного
        мандрівника. Обов'язковою зупинкою для відвідувачів є Говерла, найвища
        вершина України. Підйом на цю гору — це не лише випробування для
        фізичної витривалості, а й можливість насолодитися захоплюючими
        краєвидами, що відкриваються з вершини. Після активного дня вам
        обов'язково варто відвідати місцеві кафе, де смакують традиційні
        гуцульські страви, приготовлені з любов’ю. Яремче — ще одне популярне
        місце, де поєднуються краса природи та зручності сучасного курорту. Тут
        можна насолодитися видом знаменитого водоспаду "Пробій" та відвідати
        сувенірний ринок, де представлені унікальні вироби місцевих майстрів.
        Для тих, хто шукає затишок і спокій, чудовим вибором буде Ворохта,
        відома своїми термальними джерелами та можливістю займатися зимовими
        видами спорту. Оренда житла в Івано-Франківській області дарує
        можливість насолоджуватися красою природи, активним відпочинком та
        автентичною культурою, створюючи незабутні враження для кожного
        відвідувача.
      </p>
    </RealtyPage>
  );
}
