import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title: "Глемпінги в Ужгородському районі | Мої Карпати",
  description:
    "Відкрийте для себе глемпінги в Ужгородському районі – ідеальне місце для поєднання комфорту та близькості до природи. Насолоджуйтеся затишком стильних наметів, розташованих серед мальовничих пейзажів Закарпаття, де гори обіймають небо, а річки тихо шепочуть свої таємниці. Ідеальний вибір для романтичного відпочинку, сімейних подорожей або активних пригод, що дарують незабутні враження та безтурботні миті на лоні природи.",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/zakarpatska"}
        raion={"/uzhhorod-raion"}
        city={""}
        building={"/glamping"}
      />
      <RealtyItems
        firstFilter={[
          { title: "Глемпінги в Ужгородському районі" },
          { raion: "/uzhhorod-raion", type: "glaming" },
        ]}
        secondFilter={[
          { title: "Житло в Ужгородському районі" },
          { raion: "/uzhhorod-raion" },
        ]}
        thirdFilter={[
          { title: "Житло у Закарпатській області" },
          { oblast: "/zakarpatska" },
        ]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Глемпінги в Ужгородському районі — це новий тренд для тих, хто хоче
        насолодитися природою, не відмовляючи собі в комфорті. Ці стильні намети
        пропонують унікальний досвід, поєднуючи елементи кемпінгу з розкішшю.
        Розташовані серед мальовничих ландшафтів Закарпаття, глемпінги
        забезпечують затишок і усамітнення, що робить їх ідеальним місцем для
        романтичних вікендів, сімейних відпусток чи активного відпочинку. Кожен
        глемпінг обладнаний зручними ліжками, електрикою та навіть ванними
        кімнатами. Ви можете насолоджуватися вечорами біля вогнища, слухаючи
        шепіт лісу, і відчувати себе в повній гармонії з природою. Багато з цих
        глемпінгів пропонують також різноманітні активності, такі як пішохідні
        маршрути, велопрогулянки чи екскурсії до культурних пам’яток Закарпаття.
        Закарпатська кухня також не залишить вас байдужими. Багато глемпінгів
        мають свої ресторани або пропонують організовані барбекю, де ви зможете
        скуштувати традиційні страви, приготовані з місцевих інгредієнтів.
        Глемпінги в Ужгородському районі – це не просто місце для ночівлі, це
        можливість зануритися в атмосферу спокою і краси, подарувати собі
        незабутні миті на лоні природи та відновити енергію для нових звершень.
        Обираючи глемпінг, ви обираєте унікальний відпочинок, який
        запам’ятається надовго.
      </p>
    </RealtyPage>
  );
}
