import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Глемпінги в Мукачівському районі Карпат: Відпочинок на лоні природи з усіма зручностями | Мої Карпати",
  description:
    "Відкрийте для себе чарівний світ глемпінгів у Мукачівському районі Карпат. Це ідеальне місце для тих, хто прагне поєднати комфорт з близькістю до природи. Насолоджуйтесь затишком сучасних наметів, які забезпечують усі зручності для вашого комфортного перебування. Відправляйтеся на захоплюючі прогулянки по мальовничих стежках, відчуйте свіжий гірський повітря та пориньте у красу навколишніх пейзажів. Глемпінги — це унікальна можливість втекти від повсякденності та насолодитися незабутнім відпочинком у серці Карпат. Забронюйте свій глемпінг сьогодні і створіть яскраві спогади на тлі природної краси!",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/zakarpatska"}
        raion={"/mukachiv-raion"}
        city={""}
        building={"/glamping"}
      />
      <RealtyItems
        firstFilter={[
          { title: "Глемпінги у Мукачівському районі" },
          { raion: "/mukachiv-raion", type: "glamping" },
        ]}
        secondFilter={[
          { title: "Житло у Мукачівському районі" },
          { raion: "/mukachiv-raion" },
        ]}
        thirdFilter={[
          { title: "Житло у Закарпатській області" },
          { oblast: "/zakarpatska" },
        ]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Глемпінги в Мукачівському районі Карпат стають все популярнішим вибором
        для тих, хто бажає відпочити на лоні природи, не відмовляючись від
        комфортних умов. Якщо ви прагнете втекти від повсякденної рутини та
        насолодитися гармонією, це місце — ідеальне для вас. Розташовані в
        мальовничих куточках Мукачівського району, глемпінги поєднують у собі
        комфорт готелів та чарівність дикої природи. Сучасні намети обладнані
        усім необхідним: затишними ліжками, електрикою, а також зручними
        санвузлами. Тут ви зможете насолоджуватися свіжим повітрям, вечеряти на
        вулиці та милуватися зірками прямо з власної тераси. Глемпінги в цьому
        регіоні також пропонують безліч можливостей для активного відпочинку.
        Околиці вражають своїми живописними горами, які ідеально підходять для
        піших прогулянок, велосипедних маршрутів і зимових видів спорту. Ви
        зможете відвідати красиві водоспади, озера та річки, що пропонують
        чудові можливості для риболовлі та купання. Крім того, Мукачівський
        район відомий своїми культурними традиціями та гастрономічними
        шедеврами. Скуштуйте страви місцевої кухні та дізнайтеся більше про
        багатий культурний спадок Закарпаття. Обираючи глемпінг у Мукачівському
        районі, ви отримуєте можливість поєднати відпочинок на природі з
        комфортом і унікальним досвідом. Не втрачайте шанс! Забронюйте свій
        глемпінг та насолодіться активним відпочинком серед чудової природи
        Карпат.
      </p>
    </RealtyPage>
  );
}
