import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title: "Будинки у Дрогобицькому районі | Мої Карпати",
  description:
    "Будинки у Дрогобицькому районі – це ідеальне місце для вашого відпочинку в Карпатах. Насолоджуйтесь комфортом сучасного життя, затишком традиційних хатинок та мальовничими краєвидами. Виберіть свій варіант проживання для незабутніх сімейних вихідних або романтичних моментів на природі!",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/lvivska"}
        raion={"/drohobych-raion"}
        city={""}
        building={"/house"}
      />
      <RealtyItems
        firstFilter={[
          { title: "Будинки у Дрогобицькому районі районі" },
          { raion: "/drohobych-raion", type: "house" },
        ]}
        secondFilter={[
          { title: "Житло у Дрогобицькому районі" },
          { raion: "/drohobych-raion" },
        ]}
        thirdFilter={[
          { title: "Житло у Львівській області" },
          { oblast: "/lvivska" },
        ]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Будинки у Дрогобицькому районі – це запрошення до незабутнього
        відпочинку в обіймах карпатської природи. Цей регіон вражає своєю красою
        та різноманіттям, надаючи можливість поєднати комфорт сучасного життя з
        автентичним духом українських Карпат. Тут ви знайдете широкий спектр
        варіантів проживання: від стильних котеджів до традиційних дерев’яних
        хатинок. Кожен будинок створений для вашого зручності та затишку,
        обладнаний усім необхідним, щоб ви могли насолоджуватися відпочинком у
        комфортних умовах. Дрогобицький район також славиться активними
        можливостями для відпочинку. Прогулянки мальовничими стежками,
        велосипедні маршрути, а також візити до історичних місць – все це
        створює ідеальні умови для проведення часу з родиною чи друзями.
        Обираючи будинки у Дрогобицькому районі, ви відкриваєте для себе не
        просто місце для ночівлі, а цілий світ вражень та емоцій. Це можливість
        зануритися в красу природи, насолодитися спокоєм і відпочити від
        повсякденної метушні.
      </p>
    </RealtyPage>
  );
}
