import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title: "Відпочинок на Закарпатті: бази відпочинку в Берегово | Мої Карпати",
  description:
    "Відпочивайте з родиною серед неперевершеної краси Карпат! Наші бази відпочинку в Берегово пропонують затишні дерев’яні котеджі, дитячі майданчики, мангали для смачних пікніків та багато інших зручностей. Дозвольте вашим дітям насолодитися свіжим гірським повітрям і яскравими канікулами, які запам’ятаються надовго!",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/zakarpatska"}
        raion={"/berehiv-raion"}
        city={""}
        building={"/base"}
      />
      <RealtyItems
        firstFilter={[
          { title: "Бази відпочинку у Берегівському районі" },
          { raion: "/berehiv-raion", type: "base" },
        ]}
        secondFilter={[
          { title: "Житло у Берегівському районі" },
          { raion: "/berehiv-raion" },
        ]}
        thirdFilter={[
          { title: "Житло у Закарпатській області" },
          { oblast: "/zakarpatska" },
        ]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Бази відпочинку в Берегівському районі пропонують чудові умови для
        відпочинку серед природи. Ви знайдете комфортабельні котеджі чи номери з
        усім необхідним для зручного проживання. Можна насолодитися смачною
        закарпатською кухнею або приготувати їжу самостійно. Також доступні
        басейни з термальною водою, сауни, масажі, а для активних туристів –
        піші прогулянки, веломаршрути, рибалка чи кінні тури. Як обрати базу
        відпочинку? Щоб обрати ідеальну базу, звертайте увагу на її місце
        розташування – це допоможе насолоджуватися природними пейзажами. Також
        варто дізнатися, які послуги надає заклад, порівняти ціни та
        ознайомитися з відгуками інших відвідувачів, щоб впевнитися у якості
        сервісу. Де шукати бази відпочинку в Берегівському районі? Ви можете
        знайти бази відпочинку на спеціалізованих онлайн-ресурсах, де є опис
        послуг та фото об'єктів. Також перегляньте сторінки баз у соціальних
        мережах або зверніться до туристичних агентств, які допоможуть підібрати
        варіант, що найкраще підходить під ваші вимоги.
      </p>
    </RealtyPage>
  );
}
