import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Житло у Львівській області | Нерухомість у Львівській області| Мої Карпати",
  description:
    "Житло у Львівській області у мальовничих Карпатах: затишні котеджі, садиби та готелі для комфортного відпочинку. Насолоджуйтесь гірськими краєвидами, чистим повітрям та традиційною гостинністю.",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty oblast={"/lvivska"} raion={""} city={""} building={""} />
      <RealtyItems
        firstFilter={[
          { title: "Житло у Львівській області" },
          { oblast: "/lvivska" },
        ]}
        secondFilter={[]}
        thirdFilter={[]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Житло у Карпатах на території Львівської області — чудовий вибір для
        відпочинку серед мальовничої природи та туристичних атракцій. Цей регіон
        відомий своїми горами, чистим повітрям і культурною спадщиною,
        пропонуючи різноманітні варіанти проживання: від комфортабельних готелів
        до затишних садиб. Серед головних туристичних місць — Національний
        природний парк "Сколівські Бескиди" з його мальовничими пейзажами та
        водоспадом Кам'янка, де можна насолоджуватися прогулянками. Тустань,
        старовинна фортеця на скелях, пропонує захопливі краєвиди й історичні
        події, що часто відтворюються під час фестивалів. Для активного
        відпочинку доступні гірськолижні курорти Плай і Тисовець, які взимку
        приваблюють любителів зимових видів спорту, а влітку — піших прогулянок
        і веломаршрутів. Крім природних краєвидів, Львівська частина Карпат
        відома своїми старовинними дерев'яними церквами, такими як Церква
        Святого Духа в Потеличі, що входить до списку ЮНЕСКО. Оренда житла у
        цьому регіоні дозволяє відпочити серед природи та насолодитися
        культурними пам’ятками Карпат, роблячи ваш відпочинок незабутнім.
      </p>
    </RealtyPage>
  );
}
