import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Будинки у Закарпатській області | Кращі варіанти будиночків у Закарпатській області для відпочинку серед природи| Мої Карпати",
  description:
    "Будинки у Закарпатській області: комфортне житло серед Карпат. Затишні котеджі та сучасні будинки для відпочинку чи постійного проживання в мальовничих місцях.",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/zakarpatska"}
        raion={""}
        city={""}
        building={"/house"}
      />
      <RealtyItems
        firstFilter={[
          { title: "Будиночки у Закарпатській області" },
          { oblast: "/zakarpatska", type: "house" },
        ]}
        secondFilter={[
          { title: "Житло у Закарпатській області" },
          { oblast: "/zakarpatska" },
        ]}
        thirdFilter={[]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Закарпатська область — це справжня перлина України, де природні
        ландшафти переплітаються з багатою культурною спадщиною. Тут будинки
        стають не лише місцем проживання, а й ідеальним притулком для
        відпочинку, де кожен може знайти спокій і гармонію. Вибір житла в цьому
        регіоні варіюється від традиційних дерев'яних хаток до сучасних
        котеджів, обладнаних усіма зручностями для комфортного життя. Закарпаття
        приваблює туристів своєю неймовірною природною красою. Взимку цей край
        перетворюється на зимову казку, де лижні траси та снігові пейзажі
        запрошують до активного відпочинку. Влітку ж гірські маршрути, бурхливі
        річки і зелені лісисті простори стають ідеальним фоном для пішохідних
        прогулянок та кемпінгу. Оренда чи купівля будиночка в Закарпатті — це
        вигідний інвестиційний крок, адже регіон активно розвивається. Тут ви
        знайдете тихі куточки далеко від галасливих міст, де можна насолодитися
        природою, проте без відмови від сучасних зручностей — інтернету,
        водопостачання, комфортних умов. Закарпаття також багате на історію та
        культурні пам’ятки. Відвідування старовинних замків, традиційних церков
        та етнографічних музеїв дозволить вам зануритися в атмосферу регіону.
        Додатково, термальні курорти запрошують на оздоровлення та релаксацію,
        що стане приємним бонусом до вашого відпочинку. У підсумку, будинки в
        Закарпатті — це не просто місце для проживання, а можливість створити
        власну історію серед мальовничих карпатських пейзажів. Цей регіон вабить
        своєю природою і культурою, забезпечуючи незабутні враження та емоції
        для кожного відвідувача.
      </p>
    </RealtyPage>
  );
}
