import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Житло у Чернівецькій області | Чернівецька область Карпат має багато видів житла поряд з природою | Мої Карпати",
  description:
    "Житло у Чернівецькій області: оберіть ідеальний варіант для оренди чи купівлі – комфортні будинки, котеджі та квартири серед мальовничої природи.",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/chernivetska"}
        raion={""}
        city={""}
        building={""}
      />
      <RealtyItems
        firstFilter={[
          { title: "Житло в Чернівецькій області" },
          { oblast: "/chernivetska" },
        ]}
        secondFilter={[]}
        thirdFilter={[]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Чернівецька область в Карпатах – це місце, яке поєднує в собі природну
        красу та культурне багатство. Якщо ви шукаєте ідеальне місце для
        відпочинку, цей регіон вартий вашої уваги. Мальовничі гори, вкриті
        густими лісами, створюють атмосферу спокою і затишку, а свіже гірське
        повітря дарує відчуття свободи та здоров'я. Чернівецька область пропонує
        безліч варіантів для відпочинку. Ви можете зняти житло на будь-який
        смак: від затишних дерев'яних котеджів до сучасних будинків із усіма
        зручностями. Важливо те, що тутешні місця дозволяють забути про міську
        метушню і насолоджуватися природою, слухати спів птахів та шум річок. Це
        ідеальне місце для тих, хто хоче відновити сили та зануритися в гармонію
        природи. Окрім природних багатств, Чернівецька область приваблює
        різноманіттям культурних і історичних пам'яток. Тут можна відвідати
        старовинні церкви, монастирі та інші об’єкти, що розповідають про
        багатолітню історію регіону. Візит до Чернівців стане окремою цікавою
        подорожжю: архітектурна спадщина цього міста зачаровує своєю
        унікальністю. Чернівецька резиденція університету, що входить до списку
        спадщини ЮНЕСКО, є однією з найвідоміших пам'яток. Активні туристи теж
        знайдуть для себе безліч розваг. Піші прогулянки горами, велосипедні
        маршрути, кінні прогулянки чи катання на квадроциклах – все це доступне
        в цьому регіоні. Взимку Чернівецька область приваблює любителів
        гірськолижного спорту. Гірські курорти, що пропонують різноманітні траси
        для катання, забезпечать активний відпочинок у будь-яку пору року.
        Гостинність місцевих жителів – ще одна причина, чому варто вибрати
        відпочинок у Чернівецькій області. Місцеві мешканці з радістю приймають
        гостей, створюючи затишну атмосферу та пропонуючи справжні домашні
        страви. Це додасть вашому відпочинку тепла та особливої автентичності.
        Відпочинок у Чернівецькій області – це поєднання природної краси,
        активних розваг та культурних відкриттів. Оренда житла в цьому регіоні
        подарує вам незабутні враження та допоможе перезавантажитися,
        насолоджуючись величчю Карпат.
      </p>
    </RealtyPage>
  );
}
