import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Нерухомість в Рахівському районі: купівля та оренда будинків і земельних ділянок | Мої Карпати",
  description:
    "Широкий вибір нерухомості в Рахівському районі. Будинки, квартири та земельні ділянки серед мальовничих Карпат. Знайдіть ідеальне місце для проживання чи відпочинку.",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/zakarpatska"}
        raion={"/rakhiv-raion"}
        city={""}
        building={""}
      />
      <RealtyItems
        firstFilter={[
          { title: "Нерухомість у Рахівському районі" },
          { raion: "/rakhiv-raion" },
        ]}
        secondFilter={[
          { title: "Житло у Закарпатській області" },
          { oblast: "/zakarpatska" },
        ]}
        thirdFilter={[]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Чому варто обрати нерухомість у Рахівському районі Карпат? Рахівський
        район — це унікальне місце в Карпатах, яке пропонує неперевершені
        можливості для відпочинку та інвестицій. Оренда або покупка нерухомості
        тут дозволяє поєднати комфорт із природною красою та можливістю
        активного відпочинку. Переваги природи та активного відпочинку.
        Рахівщина відома своїми чарівними гірськими пейзажами, чистим повітрям
        та неповторною природою. Інвестуючи в нерухомість у цьому регіоні, ви
        отримуєте постійний доступ до активних розваг: гірськолижні курорти,
        пішохідні маршрути та річки для рафтингу. Це місце, де можна
        насолоджуватися тишею і мальовничими краєвидами. Оздоровчі можливості.
        Крім захоплюючого активного відпочинку, Рахівський район славиться
        своїми цілющими мінеральними джерелами. Проживаючи тут, ви матимете
        можливість оздоровитися завдяки природним ресурсам Карпат, що робить цей
        регіон ідеальним для відпочинку. Інвестиційна перспектива. Купівля
        нерухомості в Рахівському районі може стати вигідною інвестицією.
        Завдяки популярності Карпат як туристичного напрямку, багато
        подорожуючих шукають затишні будинки для відпочинку, що дозволяє
        заробляти на здачі в оренду.
      </p>
    </RealtyPage>
  );
}
