import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Готелі у Рахівському районі: Відкрийте для себе красу Карпат | Мої Карпати",
  description:
    "Відкрийте для себе затишні готелі у Рахівському районі Карпат, де комфорт та гостинність поєднуються з мальовничими пейзажами. Наші готелі пропонують сучасні зручності, якісне обслуговування та близькість до природних атракцій. Забронюйте свій номер сьогодні і насолоджуйтесь відпочинком у серці Карпат!",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/zakarpatska"}
        raion={"/rakhiv-raion"}
        city={""}
        building={"/hotel"}
      />
      <RealtyItems
        firstFilter={[
          { title: "Готелі у Рахівському районі" },
          { raion: "/rakhiv-raion", type: "hotel" },
        ]}
        secondFilter={[
          { title: "Житло у Рахівському районі" },
          { raion: "/rakhiv-raion" },
        ]}
        thirdFilter={[
          { title: "Житло у Закарпатській області" },
          { oblast: "/zakarpatska" },
        ]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Однією з основних переваг готелів у цьому районі є різноманітність
        варіантів проживання. Ви можете обрати бюджетний готель з основними
        зручностями або розкішний варіант з усіма необхідними послугами для
        комфортного відпочинку. Деякі заклади пропонують додаткові зручності,
        такі як спа-процедури, сауни та басейни, що зробить ваш відпочинок ще
        більш приємним. Рахівський район славиться своєю природою та
        можливостями для активного відпочинку. Незалежно від сезону, тут
        знайдеться безліч розваг. Улітку ви можете насолоджуватися гірськими
        походами, велосипедними прогулянками та риболовлею, а взимку — катанням
        на лижах або сноуборді. Багато готелів організовують екскурсії та
        активності, що дозволяє вам легко знайти цікаві маршрути та насолодитися
        природою. Крім того, ви матимете можливість познайомитися з місцевою
        культурою. У Рахівському районі відбувається безліч традиційних свят, і
        багато готелів пропонують екскурсії до місцевих пам’яток. Ви також
        зможете відвідати кулінарні майстер-класи, де навчитеся готувати
        традиційні гуцульські страви, що залишить незабутні спогади про ваш
        відпочинок.
      </p>
    </RealtyPage>
  );
}
