import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title: "Глемпінги в Берегово: комфорт в серці Закарпаття | Мої Карпати",
  description:
    "Глемпінги в Берегово — це унікальна можливість поєднати комфорт сучасного життя з красою дикої природи Закарпаття. Відчуйте гармонію з навколишнім середовищем, проживаючи в стильних і затишних наметах, оснащених усіма необхідними зручностями. Насолоджуйтеся природою без компромісів на комфорт: зручні ліжка, приватні тераси з мальовничими краєвидами та сучасні блага, такі як Wi-Fi і ванні кімнати. Глемпінг в Берегово — це ваш ідеальний варіант для відпочинку в оточенні природи, не жертвуючи звичними зручностями.",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/zakarpatska"}
        raion={"/berehiv-raion"}
        city={""}
        building={"/glamping"}
      />
      <RealtyItems
        firstFilter={[
          { title: "Глемпінги у Берегівському районі" },
          { raion: "/berehiv-raion", type: "glamping" },
        ]}
        secondFilter={[
          { title: "Житло у Берегівському районі" },
          { raion: "/berehiv-raion" },
        ]}
        thirdFilter={[
          { title: "Житло у Закарпатській області" },
          { oblast: "/zakarpatska" },
        ]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Глемпінги в Берегово — це інноваційний спосіб відпочинку на природі,
        який поєднує у собі чарівність дикої природи з комфортом п’ятизіркових
        готелів. Унікальний формат проживання дозволяє туристам насолоджуватися
        усіма зручностями сучасного життя, водночас перебуваючи в оточенні
        мальовничих закарпатських краєвидів. Просторі намети глемпінгів у
        Берегово обладнані зручними ліжками, стильними меблями та приватними
        ванними кімнатами. Затишні тераси відкривають неперевершені панорами на
        гори та ліси, створюючи ідеальну атмосферу для відпочинку. У таких
        місцях ви зможете повноцінно розслабитися, відволіктися від міської
        метушні та відчути гармонію з природою. Окрім комфорту, глемпінги в
        Берегово пропонують безліч можливостей для активного відпочинку:
        велопрогулянки, походи в гори, купання в термальних джерелах. Для тих,
        хто цінує релакс, доступні СПА-послуги, що допоможуть відновити сили та
        енергію. Відпочинок у глемпінгах стає справжньою пригодою для душі й
        тіла, даруючи не лише спокій, але й нові враження від близькості до
        природи. Обирайте глемпінг у Берегово для свого наступного відпочинку —
        і ви отримаєте незабутні емоції в поєднанні з комфортом, який природа та
        сучасні зручності можуть подарувати.
      </p>
    </RealtyPage>
  );
}
