import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Житло в Косівському районі: Найкращі варіанти для туристів | Мої Карпати",
  description:
    "Знайдіть ідеальне житло в Косівському районі для вашого відпочинку в Карпатах! Вибирайте з комфортабельних котеджів, автентичних садиб та затишних готелів. Насолоджуйтесь мальовничими пейзажами, традиційною кухнею та гостинністю місцевих жителів. Ваші незабутні моменти в природі починаються тут!",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/ivano-frankivska"}
        raion={"/kosiv-raion"}
        city={""}
        building={""}
      />
      <RealtyItems
        firstFilter={[
          { title: "Житло у Косівському районі" },
          { raion: "/kosiv-raion" },
        ]}
        secondFilter={[
          { title: "Житло у Івано-Франківській області" },
          { oblast: "/ivano-frankivska" },
        ]}
        thirdFilter={[]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Косівський район, розташований серед величних Карпат, є справжнім
        скарбом для тих, хто шукає відпочинок у гармонії з природою. Цей регіон
        славиться своєю красивою природою, унікальною культурою та гостинністю
        місцевих жителів. Якщо ви плануєте відпочинок тут, важливо знайти
        комфортне житло, яке задовольнить усі ваші потреби. У Косівському районі
        є безліч варіантів житла. Затишні котеджі, розташовані на узвишшях,
        пропонують чудові краєвиди на гори та ліс. Вони часто обладнані
        сучасними кухнями та комфортними спальнями, що дозволяє вам відчути себе
        як вдома. Уявіть собі, як ви проводите вечір на терасі, насолоджуючись
        красивим заходом сонця та свіжим карпатським повітрям! На мій погляд,
        Косівський район — це ідеальне місце для тих, хто хоче відпочити від
        буденності, насолодитися красою природи та доторкнутися до культурних
        традицій регіону. Нехай це буде романтична подорож, відпочинок із сім'єю
        або активна поїздка з друзями — ви обов'язково знайдете тут щось
        особливе. Не забудьте заздалегідь забронювати житло, щоб забезпечити
        собі незабутні моменти в серці Карпат!
      </p>
    </RealtyPage>
  );
}
