import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Тячівський район: Затишні будинки для сімейного відпочинку | Мої Карпати",
  description:
    "Знайдіть ідеальні будинки для відпочинку в Тячівському районі! Наш сайт пропонує різноманітні варіанти житла, де ви зможете насолоджуватися природою, комфортом та спокоєм. Від затишних сімейних будинків до романтичних місць для двох — у нас є все для вашого незабутнього відпочинку. Бронюйте свій відпочинок у Тячівському районі вже сьогодні та насолоджуйтеся красою Карпат!",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/zakarpatska"}
        raion={"/tyachiv-raion"}
        city={""}
        building={"/house"}
      />
      <RealtyItems
        firstFilter={[
          { title: "Будиночки у Тячівському районі" },
          { raion: "/tyachiv-raion", type: "house" },
        ]}
        secondFilter={[
          { title: "Житло у Тячівському районі" },
          { raion: "/tyachiv-raion" },
        ]}
        thirdFilter={[
          { title: "Житло у Закарпатській області" },
          { oblast: "/zakarpatska" },
        ]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Чому варто обрати будинок для відпочинку в Тячівському районі?
        Тячівський район — це справжня перлина природи, що відкриває безліч
        можливостей для незабутнього відпочинку. Обираючи будинок у цьому
        регіоні, ви отримуєте комфорт, приватність і можливість зануритися в
        атмосферу природи. Тут вас чекають величні гори, густі ліси, бурхливі
        річки та чисті озера — все це створює ідеальні умови для відпочинку на
        природі. Ви зможете насолоджуватися різноманітними активностями, такими
        як гірський туризм, велоспорт, лижний та сноубордний спорт, а також
        риболовля. Цілющі мінеральні води та термальні джерела додатково
        сприятимуть оздоровленню вашого організму. Обираючи будинок, ви
        отримуєте приватну територію, де можете облаштувати все на свій смак і
        відчувати себе як вдома. Це гарантує автономність і можливість займатися
        віддаленою роботою, якщо це необхідно. Інвестування в нерухомість у
        Тячівському районі також є вигідним рішенням завдяки зростаючому попиту
        на житло, високій орендній платі та стабільності вартості. Цей регіон
        також відомий своєю унікальною закарпатською культурою, традиціями та
        ремеслами. Ви зможете скуштувати смачні страви місцевої кухні та
        зануритися в атмосферу автентичного Закарпаття. Обираючи будинок для
        відпочинку в Тячівському районі, ви не лише інвестуєте у власне
        комфортне життя, але й отримуєте можливість насолоджуватися красою
        природи, активним способом життя та створювати затишне гніздечко для
        себе і своєї родини.
      </p>
    </RealtyPage>
  );
}
