import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Чарівні бази відпочинку в Хустському районі: Відкрийте для себе красу Карпат! | Мої Карпати",
  description:
    "Відкрийте для себе незабутній відпочинок у Хустському районі! Наші бази пропонують комфортне проживання серед мальовничих пейзажів Карпат. Насолоджуйтеся свіжим повітрям, активними видами відпочинку та автентичною закарпатською кухнею. Ідеальне місце для сімейного відпочинку або романтичних вікендів.",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/zakarpatska"}
        raion={"/khust-raion"}
        city={""}
        building={"/base"}
      />
      <RealtyItems
        firstFilter={[
          { title: "Бази відпочинку у Хустському районі" },
          { raion: "/khust-raion", type: "base" },
        ]}
        secondFilter={[
          { title: "Житло у Хустському районі" },
          { raion: "/khust-raion" },
        ]}
        thirdFilter={[
          { title: "Житло у Закарпатській області" },
          { oblast: "/zakarpatska" },
        ]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Хустський район — це справжня оаза для тих, хто прагне втекти від
        міської метушні і зануритися в природну красу Карпат. Обираючи базу
        відпочинку в цьому регіоні, ви отримуєте можливість відчути справжній
        комфорт, а також насолодитися незабутніми моментами на лоні природи. Цей
        район вражає своїми живописними ландшафтами: високі гори, зелені ліси та
        чисті річки створюють ідеальне середовище для активного відпочинку. Ви
        можете відправитися на піші прогулянки, катання на велосипедах або
        спробувати риболовлю в одних із найкрасивіших місць Закарпаття. Взимку
        ви зможете насолодитися лижними спусками і зимовими видами спорту на
        сусідніх гірськолижних курортах. Обираючи базу для відпочинку, ви
        отримуєте переваги приватності та затишку. Багато з них пропонують
        сучасні котеджі, які забезпечують всі необхідні зручності для
        комфортного проживання. Можливість приготування їжі на свіжому повітрі
        або у повністю обладнаній кухні додає особливого шарму вашій відпустці.
        Не забудьте скуштувати місцеві страви закарпатської кухні, які вразять
        вас своєю різноманітністю і неповторним смаком. Культурна спадщина
        Хустського району подарує вам незабутні враження, які залишаться в
        пам’яті надовго. Отже, якщо ви мрієте про ідеальне місце для відпочинку
        серед природи, обирайте бази в Хустському районі. Це місце, де
        гармонійно поєднуються комфорт, краса природного середовища і можливість
        відновити сили. Ваша відпустка тут стане не лише приємною, а й повною
        позитивних емоцій та вражень!
      </p>
    </RealtyPage>
  );
}
