import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Котедж для відпочинку в Мукачівському районі: Комфорт і природа Карпат | Мої Карпати",
  description:
    "Орендуйте котедж у Мукачівському районі та насолодіться відпочинком серед мальовничих Карпат. Комфортне житло, чисте повітря та незабутні краєвиди забезпечать чудовий відпочинок на природі.",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/zakarpatska"}
        raion={"/mukachiv-raion"}
        city={""}
        building={"/cottage"}
      />
      <RealtyItems
        firstFilter={[
          { title: "Котеджі у Мукачівському районі" },
          { raion: "/mukachiv-raion", type: "cottage" },
        ]}
        secondFilter={[
          { title: "Житло у Мукачівському районі" },
          { raion: "/mukachiv-raion" },
        ]}
        thirdFilter={[
          { title: "Житло у Закарпатській області" },
          { oblast: "/zakarpatska" },
        ]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Оренда котеджу в Мукачівському районі — це чудовий спосіб втекти від
        міської метушні і зануритися в атмосферу природи Карпат. Цей район
        славиться своїми захоплюючими пейзажами, кришталево чистими ріками та
        величними горами, які створюють ідеальні умови для відпочинку. Чому
        варто обрати котедж у Мукачівському районі? Перш за все, котеджі
        пропонують зручність і приватність, якої бракує у звичайних готелях. Ви
        зможете самостійно планувати свій день, приготувати улюблені страви на
        обладнаній кухні або влаштувати вечерю на свіжому повітрі. Це робить
        відпочинок більш затишним і домашнім. По-друге, Мукачівський район
        пропонує безліч можливостей для активного відпочинку. Тут можна
        займатися пішим туризмом, велоспортом, риболовлею чи просто
        насолоджуватися прогулянками серед живописних ландшафтів. У теплу пору
        року варто дослідити численні туристичні стежки, а взимку — спробувати
        катання на лижах або сноуборді. Крім активностей, Мукачівський район
        багатий на культурні традиції Закарпаття. Відвідуйте місцеві ресторани,
        щоб скуштувати автентичні страви, або загляньте на традиційні ярмарки,
        щоб ознайомитися з ремеслами регіону. Орендувавши котедж у Мукачівському
        районі, ви не лише знайдете комфортне місце для відпочинку, а й
        отримаєте можливість зануритися в унікальну природу та культуру цього
        мальовничого регіону. Заплануйте свій відпочинок вже сьогодні, щоб
        насолодитися всіма перевагами Карпат!
      </p>
    </RealtyPage>
  );
}
