import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Затишні Готелі Закарпатської області – Комфорт та Природа в Гармонії | Мої Карпати",
  description:
    "Затишні готелі Закарпаття чекають на вас! Відпочинок у горах з комфортом, чудовими краєвидами та сучасними умовами проживання. Ідеальний вибір для подорожі в будь-яку пору року.",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/zakarpatska"}
        raion={""}
        city={""}
        building={"/hotel"}
      />
      <RealtyItems
        firstFilter={[
          { title: "Готелі у Закарпатській області" },
          { oblast: "/zakarpatska", type: "hotel" },
        ]}
        secondFilter={[
          { title: "Житло у Закарпатській області" },
          { oblast: "/zakarpatska" },
        ]}
        thirdFilter={[]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Ось дещо змінений і вдосконалений варіант тексту: Готелі Закарпаття:
        сучасний комфорт у серці Карпат Закарпаття – це край, де неймовірні
        пейзажі гірських вершин, кришталеві річки та мальовничі ліси створюють
        ідеальні умови для відпочинку. Готелі цього регіону – це місця, де
        поєднуються сучасні зручності та автентична карпатська гостинність,
        надаючи можливість кожному гостю відчути справжній затишок. Кожен готель
        у Закарпатті має свою неповторну атмосферу, відображаючи місцеві
        традиції та культурні особливості краю. Незалежно від того, чи ви
        шукаєте спокій та усамітнення, чи прагнете активного відпочинку, готелі
        цього регіону здатні задовольнити будь-які потреби. Ви зможете обрати
        готель, розташований посеред гір, біля озер або в затишних містечках, де
        природа завжди поряд. Закарпатські готелі пропонують високий рівень
        сервісу та безліч можливостей для незабутнього відпочинку: від
        спа-процедур до екскурсій і розваг на природі. Кожен день перебування
        тут стане для вас можливістю насолодитися комфортом, красою
        навколишнього світу та приємною атмосферою відновлення.
      </p>
    </RealtyPage>
  );
}
