import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Котеджі у Тячівському районі: Ваш комфортний куточок у Карпатах | Мої Карпати",
  description:
    "Відкрийте для себе затишні котеджі у Тячівському районі Карпат! Наш сайт пропонує широкий вибір комфортних котеджів, де ви зможете насолодитися красою природи, активним відпочинком і спокоєм. Незалежно від того, чи плануєте ви сімейний вікенд, романтичну втечу або активний відпочинок на свіжому повітрі, у нас є ідеальне житло для вас. Забронюйте свій котедж у Тячівському районі вже сьогодні та насолоджуйтеся незабутніми моментами у Карпатах!",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/zakarpatska"}
        raion={"/tyachiv-raion"}
        city={""}
        building={"/cottage"}
      />
      <RealtyItems
        firstFilter={[
          { title: "Котеджі у Тячівському районі" },
          { raion: "/tyachiv-raion", type: "cottage" },
        ]}
        secondFilter={[
          { title: "Житло у Тячівському районі" },
          { raion: "/tyachiv-raion" },
        ]}
        thirdFilter={[
          { title: "Житло у Закарпатській області" },
          { oblast: "/zakarpatska" },
        ]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Чому варто обрати котедж для відпочинку в Тячівському районі? Тячівський
        район — це справжнє диво природи, яке дарує можливості для незабутнього
        відпочинку на лоні дикої природи. Вибір котеджу у цьому регіоні
        забезпечує вам комфорт, приватність і безліч вражень, які залишаться в
        пам'яті назавжди. Цей край вражає своєю незайманою природою: величні
        гори, густі ліси, кришталево чисті річки та мальовничі озера створюють
        ідеальну атмосферу для релаксації. Тут можна віддатися різноманітним
        активностям: від гірського туризму до велоспорту, лижного спорту,
        сноубордингу та риболовлі. Водні джерела та термальні води не тільки
        додають унікальності, але й сприяють оздоровленню. Обираючи котедж, ви
        отримуєте простір для самовираження: власний двір, де можна влаштувати
        барбекю, або затишний куточок для читання під відкритим небом. Ця
        автономність дарує відчуття домашнього затишку та дозволяє вам працювати
        віддалено, якщо виникне така потреба. Інвестування в нерухомість у
        Тячівському районі — це розумний крок, адже зростаючий попит на житло та
        стабільність вартості роблять цю інвестицію вигідною. Крім того,
        Тячівський район відомий своєю багатою культурною спадщиною. Ви зможете
        насолодитися унікальними традиціями, місцевими ремеслами та смачною
        закарпатською кухнею, що надає вашому відпочинку додаткову цінність.
        Котедж для відпочинку в Тячівському районі — це не лише можливість
        насолоджуватися природою, це ваш шлях до гармонії з собою. Це місце, де
        можна вести активний спосіб життя, відпочивати від повсякденності та
        створити затишний простір для родини і друзів.
      </p>
    </RealtyPage>
  );
}
