import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Глемпінг у Карпатах | Фантастичний відпочинок у купольних будинках з неймовірним краєвидом на гори| Мої Карпати",
  description:
    "Відкрийте для себе глемпінги у Карпатах — це чудова можливість поєднати затишок і красу природи. Стильні намети та комфортні котеджі з усіма зручностями, розташовані в живописних куточках, подарують вам незабутні враження. Насолоджуйтесь активним відпочинком: піші прогулянки, велосипедні поїздки та екскурсії до природних пам'яток. Глемпінги у Карпатах також пропонують ексклюзивні послуги, такі як приватні вечері та спа-процедури. Вибір глемпінгів — це ідеальне рішення для тих, хто прагне гармонії між природою та комфортом.",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty oblast={""} raion={""} city={""} building={"/glamping"} />
      <RealtyItems
        firstFilter={[
          { title: "Купольні будинки в Карпатах" },
          { type: "glamping" },
        ]}
        secondFilter={[]}
        thirdFilter={[]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Комфортні умови: Глемпінг у Карпатах пропонує більш комфортні умови, ніж
        традиційний кемпінг. Це можуть бути елегантні намети, котеджі або навіть
        дерев'яні будинки, обладнані меблями, електрикою, ванними кімнатами та
        іншими зручностями. Природне розташування: Глемпінг-локації у Карпатах
        зазвичай розташовані в живописних місцях, таких як національні парки,
        берег річки або в горах, що дозволяє насолоджуватися красою природи.
        Ексклюзивні послуги: Глемпінг у Карпатах часто пропонує додаткові
        послуги, такі як приватні вечері, спа-процедури або організацію
        екскурсій. Стиль і атмосфера: Проживання в глемпінгу у Карпатах, як
        правило, має естетичний і стильний вигляд, з акцентом на створення
        особливої атмосфери та оформлення.
      </p>
    </RealtyPage>
  );
}
