import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Знайдіть ідеальний готель у Берегівському районі для незабутньої подорожі | Мої Карпати",
  description:
    "Ласкаво просимо на сайт, де ви знайдете найкращі готелі Берегівського району для вашого незабутнього відпочинку! Від комфортабельних готелів з сучасним дизайном до затишних закладів, які зберігають місцеві традиції, наші пропозиції задовольнять будь-які ваші побажання. Насолоджуйтеся гостинністю Закарпаття, зупиняючись у готелях, розташованих у мальовничих місцях поруч із термальними джерелами та СПА-центрами. Незалежно від того, чи шукаєте ви релаксацію чи активний відпочинок, наші готелі стануть ідеальним вибором для вашої подорожі.",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/zakarpatska"}
        raion={"/berehiv-raion"}
        city={""}
        building={"/hotel"}
      />
      <RealtyItems
        firstFilter={[
          { title: "Готелі у Берегівському районі" },
          { raion: "/berehiv-raion", type: "hotel" },
        ]}
        secondFilter={[
          { title: "Житло у Берегівському районі" },
          { raion: "/berehiv-raion" },
        ]}
        thirdFilter={[
          { title: "Житло у Закарпатській області" },
          { oblast: "/zakarpatska" },
        ]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Готелі в Берегівському районі — це поєднання виняткового комфорту та
        вишуканих зручностей, що перетворять ваш відпочинок на справжню казку.
        Просторі, комфортабельні номери, сповнені затишку, чудова кухня з
        вишуканими стравами, басейни з цілющою термальною водою та розкішні
        СПА-центри — все це створено для вашого незабутнього релаксу. Вибір
        готелів тут надзвичайно різноманітний — від затишних, бюджетних закладів
        до елітних комплексів, кожен з яких наповнить ваш відпочинок нотками
        розкоші та гармонії. Багато готелів розташовані у самому серці міста або
        неподалік захоплюючих туристичних місць, що дозволить вам без зусиль
        насолоджуватися всіма скарбами регіону. Окрім висококласного проживання,
        готелі пропонують чимало додаткових послуг: організацію захоплюючих
        екскурсій, прокат велосипедів для активних мандрівок, комфортний
        трансфер та багато інших зручностей, що забезпечать вам безтурботний
        відпочинок. А уважний та привітний персонал, який готовий виконати
        будь-яке ваше бажання, доповнить ваші враження справжньою закарпатською
        гостинністю.
      </p>
    </RealtyPage>
  );
}
