import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Готелі в Івано-Франківській області: насолоджуйтесь комфортом у Карпатах",
  description:
    "Відкрийте для себе затишні готелі в Івано-Франківській області та насолоджуйтесь красою Карпат. Сучасні зручності, захоплюючі пейзажі та активний відпочинок чекають на вас!",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/ivano-frankivska"}
        raion={""}
        city={""}
        building={"/hotel"}
      />
      <RealtyItems
        firstFilter={[
          { title: "Готелі в Івано-Франківській області" },
          { oblast: "/ivano-frankivska", type: "hotel" },
        ]}
        secondFilter={[
          { title: "Житло у Івано-Франківській області" },
          { oblast: "/ivano-frankivska" },
        ]}
        thirdFilter={[]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Івано-Франківщина з її мальовничими гірськими ландшафтами стала
        популярним місцем для відпочинку в Україні. Орендувавши номер у готелі,
        ви зможете насолодитися всіма перевагами цього унікального регіону. Чому
        обрати готель у Карпатах? Різноманіття вибору: Готелі в
        Івано-Франківській області пропонують широкий асортимент: від доступних
        варіантів до розкішних комплексів. Ви зможете знайти місце, що підходить
        саме вам — з прекрасним видом на гори, поряд із гірськолижними трасами
        або в тихому куточку біля річки. Затишок та обслуговування: Сучасні
        готелі пропонують комфортні номери з усіма зручностями: зручні ліжка,
        ванні кімнати, міні-бари і телевізори. Багато закладів також мають
        додаткові послуги — від спа-процедур до ресторанів із смачними стравами.
        Активний відпочинок на свіжому повітрі: Більшість готелів розташовані
        поблизу туристичних маршрутів, гірськолижних курортів і природних
        водойм. Ви зможете займатися пішими прогулянками, велоспортом, катанням
        на лижах або просто насолоджуватися природою. Відновлення та релаксація:
        Чисте повітря Карпат, спокійна атмосфера та гарні краєвиди допоможуть
        вам відновити сили і зняти стрес. Багато готелів пропонують процедури
        для покращення здоров’я та краси. Занурення у культуру: Ви матимете
        можливість відвідати місцеві музеї, фестивалі та скуштувати автентичні
        страви регіону. Переваги готелів у порівнянні з іншими видами
        розміщення: Незалежність: У готелі вам не потрібно турбуватися про
        щоденні домашні справи, такі як прибирання чи приготування їжі. Широкий
        спектр зручностей: Готелі пропонують додаткові сервіси, які можуть бути
        недоступні в інших місцях проживання. Розвинена інфраструктура: У
        готелях часто є ресторани, кафе та конференц-зали, що підходять для
        ділових зустрічей або відпочинку з друзями. Безпека: Готелі забезпечують
        високий рівень безпеки, щоб ваш відпочинок був максимально комфортним.
      </p>
    </RealtyPage>
  );
}
