import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Відпочинок у Закарпатті: топ баз для комфортного відпочинку| Мої Карпати",
  description:
    "Бази відпочинку в Закарпатті: ваш ідеальний куточок для відпустки. Закарпаття — це справжня оаза для відпочинку, де кожен може насолодитися гармонією природи та сучасними зручностями. Наші бази відпочинку пропонують широкий спектр послуг, які задовольнять будь-які побажання.",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/zakarpatska"}
        raion={""}
        city={""}
        building={"/base"}
      />
      <RealtyItems
        firstFilter={[
          { title: "Бази відпочинку Закарпатської області" },
          { oblast: "/zakarpatska", type: "base" },
        ]}
        secondFilter={[
          { title: "Житло у Закарпатській області" },
          { oblast: "/zakarpatska" },
        ]}
        thirdFilter={[]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Бази відпочинку в Закарпатті пропонують безліч можливостей для
        комфортного і приємного проведення часу. Ви можете обрати серед
        різноманітних варіантів розміщення, включаючи затишні котеджі та
        будиночки, які створять відчуття домашнього тепла. Смачна домашня кухня
        стане приємним доповненням до вашого відпочинку. Тут ви зможете
        насолодитися стравами, приготованими з місцевих продуктів, а також
        скористатися можливістю приготування барбекю на свіжому повітрі. Для
        активних туристів передбачено безліч розваг. Сауни, басейни, більярд та
        теніс — все це зробить ваш відпочинок насиченим і веселим. Також ви
        можете взяти напрокат велосипеди або скористатися послугами екскурсій,
        щоб дослідити красу Закарпаття. Не менш важливими є зручності, які ви
        отримаєте під час перебування. Трансфер, пральня та безкоштовний Wi-Fi
        забезпечать вам комфорт і легкість у організації свого відпочинку. Щоб
        обрати ідеальну базу відпочинку, спершу визначте свої пріоритети.
        Подумайте, що є для вас найважливішим — ціна, зручності чи розташування.
        Читайте відгуки інших відпочиваючих, щоб дізнатися більше про обрану
        базу. Порівняйте ціни через онлайн-сервіси, щоб знайти найкращі
        пропозиції, і не забувайте звертати увагу на сезонність, адже деякі бази
        працюють лише в літній період.
      </p>
    </RealtyPage>
  );
}
