import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Затишні будиночки у Львівській області: ваш ідеальний відпочинок у Карпатах| Мої Карпати",
  description:
    "Затишні будиночки у Львівській області: відпочинок у серці Карпат!Зануртесь у комфорт і спокій наших будиночків у Львівській області, розташованих серед чудових карпатських пейзажів. Ідеальні для сімейного відпочинку або романтичних вікендів, ці оселі забезпечать вам всі необхідні зручності. Відкрийте для себе активності на природі, насолоджуйтеся свіжим повітрям та створюйте незабутні спогади у затишному куточку Карпат!",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/lvivska"}
        raion={""}
        city={""}
        building={"/house"}
      />
      <RealtyItems
        firstFilter={[
          { title: "Будинки у Львівській області" },
          { oblast: "/lvivska", type: "house" },
        ]}
        secondFilter={[
          { title: "Житло у Львівській області" },
          { oblast: "/lvivska" },
        ]}
        thirdFilter={[]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Відпочинок у будиночках Карпат: затишок серед величних гір. Львівська
        область — це справжній скарб для поціновувачів природи, де Карпатські
        гори дарують незабутні моменти спокою та відновлення. Проживання в
        затишних дерев'яних будиночках стало популярним способом насолодитися
        цим природним раєм. Власний будиночок забезпечує вам максимальну
        свободу: тут ви можете спланувати свій день так, як хочете,
        насолоджуючись домашніми стравами на власній кухні або відпочиваючи на
        терасі з чудовим видом на навколишні пейзажі. Дерев'яні стіни та теплий
        камін створюють атмосферу затишку, що дозволяє вам забути про буденні
        турботи. Близькість до природи робить кожну мить особливою. Ви зможете
        вдосталь насолодитися свіжим повітрям і красою Карпат, а активний
        відпочинок стане невід'ємною частиною вашого відпочинку. Скільки радості
        дарують прогулянки лісами, катання на лижах або просто насолода красою
        гірських ландшафтів! Не забудьте про романтичну атмосферу, яка панує в
        таких будиночках. Це ідеальне місце для закоханих, які прагнуть втекти
        від метушні повсякденності та створити незабутні спогади разом.
      </p>
    </RealtyPage>
  );
}
