import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Житло у Верховинському районі Карпат: Котеджі, садиби та готелі для туристів | Мої Карпати",
  description:
    "Шукаєте ідеальне житло у Верховинському районі Карпат? Оберіть з комфортабельних котеджів, затишних садиб та готелів для незабутнього відпочинку в горах. Насолоджуйтесь красою Карпат, чистим повітрям та гостинністю місцевих жителів. Забронюйте свій відпочинок у Верховині вже сьогодні!",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/ivano-frankivska"}
        raion={"/verkhovyna-raion"}
        city={""}
        building={""}
      />
      <RealtyItems
        firstFilter={[
          { title: "Житло у Верховинському районі" },
          { raion: "/verkhovyna-raion" },
        ]}
        secondFilter={[
          { title: "Житло у Івано-Франківській області" },
          { oblast: "/ivano-frankivska" },
        ]}
        thirdFilter={[]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Верховинський район, розташований у самому серці Карпат, пропонує
        туристам неперевершені умови для відпочинку серед природи. Якщо ви
        шукаєте місце для втечі від міської метушні, цей район стане ідеальним
        варіантом. Однак, важливим елементом вдалого відпочинку є вибір
        комфортного житла, яке відповідатиме всім вашим потребам. У
        Верховинському районі ви знайдете великий вибір житла: від затишних
        котеджів до традиційних карпатських садиб та готелів. Котеджі ідеально
        підходять для тих, хто хоче насолоджуватися спокоєм і краєвидами гір,
        перебуваючи в комфортних умовах. Обладнані сучасною технікою, вони
        забезпечують всі зручності, щоб ви відчули себе як удома. Для тих, хто
        хоче зануритися в автентичну атмосферу Карпат, найкращим вибором стануть
        приватні садиби. Тут ви зможете спробувати традиційні страви гуцульської
        кухні та відчути гостинність місцевих жителів. Багато господарів садиб
        пропонують також цікаві екскурсії, щоб ви могли дослідити всі найкращі
        місця Верховинського району. Готелі у Верховині також надають відмінні
        умови для комфортного відпочинку. Вони пропонують різноманітні послуги —
        від смачних страв у ресторанах до спа-процедур, що допоможуть
        розслабитися після дня активного відпочинку на природі. Не менш цікавими
        варіантами є хостели та кемпінги для мандрівників, які шукають бюджетні
        варіанти проживання. Це чудова можливість побути ближче до природи і
        водночас не витратити зайвих коштів. Верховинський район Карпат — це
        місце, де кожен може знайти житло до смаку та насолодитися неймовірними
        природними краєвидами. Плануйте свій відпочинок вже сьогодні і відчуйте
        справжню магію Карпат!
      </p>
    </RealtyPage>
  );
}
