import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Оренда житла в Надвірнянському районі Карпат: Комфорт та природа | Мої Карпати",
  description:
    "Шукаєте ідеальне житло у Надвірнянському районі Карпат? Відкрийте для себе комфортабельні котеджі, затишні садиби та готелі для незабутнього відпочинку в горах. Насолоджуйтесь мальовничими пейзажами, чистим повітрям і гостинністю місцевих жителів. Забронюйте своє місце вже сьогодні!",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/ivano-frankivska"}
        raion={"/nadvirna-raion"}
        city={""}
        building={""}
      />
      <RealtyItems
        firstFilter={[
          { title: "Житло у Надвірнянському районі" },
          { raion: "/nadvirna-raion" },
        ]}
        secondFilter={[
          { title: "Житло у Івано-Франківській області" },
          { oblast: "/ivano-frankivska" },
        ]}
        thirdFilter={[]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Надвірнянський район, розташований у самому серці Карпат, вражає своїми
        неймовірними пейзажами, чистим гірським повітрям та багатими
        можливостями для відпочинку. Незалежно від того, чи ви шукаєте тихий
        куточок для спокійного релаксу, чи плануєте активну відпустку,
        правильний вибір житла стане запорукою вашого незабутнього відпочинку. У
        районі представлений широкий вибір житла, що відповідає будь-яким
        потребам і бюджету. Якщо вам до вподоби затишок і усамітнення, оренда
        котеджу — чудовий варіант. Ці будинки, розташовані на схилах карпатських
        гір, дозволяють насолоджуватися захопливими краєвидами просто з вікон.
        Котеджі обладнані всім необхідним для комфортного відпочинку, включаючи
        сучасні кухні, затишні тераси та каміни, які створюють атмосферу тепла і
        затишку. Для тих, хто хоче відчути справжній колорит Карпат, варто
        звернути увагу на приватні садиби. Тут ви зможете зануритися в місцеву
        культуру, скуштувати страви традиційної кухні та дізнатися більше про
        життя мешканців Карпат. Багато господарів із задоволенням організовують
        для своїх гостей екскурсії до мальовничих місць і пропонують автентичні
        страви власного приготування.
      </p>
    </RealtyPage>
  );
}
