import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Котеджі в Карпатах: відпочинок серед природи Чернівецької області | Мої Карпати",
  description:
    "Оренда котеджів у Чернівецькій області — це чудова можливість насолодитися красою Карпат. Комфортні умови, затишна атмосфера та близькість до природи створять ідеальний відпочинок.",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/chernivetska"}
        raion={""}
        city={""}
        building={"/cottage"}
      />
      <RealtyItems
        firstFilter={[
          { title: "Котеджі у Чернівецькій області" },
          { oblast: "/chernivetska", type: "cottage" },
        ]}
        secondFilter={[
          { title: "Житло у Чернівецькій області" },
          { oblast: "/chernivetska" },
        ]}
        thirdFilter={[]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Котеджі в Чернівецькій області: Ідеальний відпочинок у серці Карпат
        Відпочинок у котеджі в Чернівецькій області — це унікальна можливість
        поєднати комфорт сучасного житла з неповторною природною красою Карпат.
        Регіон відомий своєю мальовничістю, свіжим повітрям і різноманіттям
        можливостей для активного та спокійного дозвілля. Оренда котеджу
        дозволяє відчути приватність і незалежність: ви можете обирати зручний
        для себе графік, готувати їжу власноруч чи насолоджуватися стравами
        місцевих ресторанів. Котеджі часто розташовані у віддалених і тихих
        місцях, що створює атмосферу повного релаксу серед гір та лісів. Багато
        котеджів пропонують сучасні зручності: обладнані кухні, каміни, сауни,
        басейни, що робить ваш відпочинок максимально комфортним. Для любителів
        активного відпочинку неподалік завжди є туристичні маршрути,
        гірськолижні траси, озера та річки, де можна зайнятися риболовлею чи
        водними видами спорту. Котеджі в Чернівецькій області — це чудовий вибір
        для сімейного відпочинку або романтичної подорожі. Близькість до природи
        та затишок створять ідеальні умови для незабутніх вихідних у Карпатах.
      </p>
    </RealtyPage>
  );
}
