import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Житло в Ужгородському районі: Комфортні Садиби, Котеджі та Апартаменти для Вашого Відпочинку | Мої Карпати",
  description:
    "Відкрийте для себе широкий вибір житла в Ужгородському районі: затишні котеджі, комфортні апартаменти та традиційні садиби. Насолоджуйтесь мальовничими пейзажами, культурною спадщиною та активним відпочинком в серці Закарпаття. Ідеальне місце для сімейного відпочинку, романтичних втеч чи подорожей з друзями!",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/zakarpatska"}
        raion={"/uzhhorod-raion"}
        city={""}
        building={""}
      />
      <RealtyItems
        firstFilter={[
          { title: "Житло в Ужгородському районі" },
          { raion: "/uzhhorod-raion" },
        ]}
        secondFilter={[
          { title: "Житло у Закарпатській області" },
          { oblast: "/zakarpatska" },
        ]}
        thirdFilter={[]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Ужгородський район — це справжня перлина Закарпаття, що пропонує
        вражаючу природну красу та різноманітні можливості для активного
        проведення часу. Якщо ви шукаєте місце для відновлення сил і отримання
        нових вражень, цей регіон забезпечить вам комфортне житло на будь-який
        смак. Один з найважливіших аспектів, які варто враховувати при виборі
        місця для відпочинку, — це різноманітність житлових варіантів.
        Ужгородський район пропонує чудові котеджі, затишні апартаменти та
        автентичні садиби, які поєднують комфорт і традиційний стиль. Ви зможете
        насолоджуватися атмосферою домашнього затишку та зручностями сучасного
        життя. Природа тут вражає своєю унікальністю: гори, лісові масиви, та
        кришталево чисті річки створюють ідеальні умови для пішохідних та
        велосипедних маршрутів. Відкривайте нові горизонти, займаючись
        риболовлею або просто відпочиваючи біля води, насолоджуючись свіжим
        повітрям та співом птахів.
      </p>
    </RealtyPage>
  );
}
