import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Відпочинок у Тячівському районі: Найкращі готелі для вашої подорожі | Мої Карпати",
  description:
    "Знайдіть свій ідеальний готель у Тячівському районі! Наш сайт пропонує широкий вибір комфортних готелів, що відповідають будь-яким потребам та бюджетам. Насолоджуйтеся затишком, сучасними зручностями та неймовірними краєвидами Карпат. Відкрийте для себе активний відпочинок, культурні пам'ятки та гастрономічні делікатеси Закарпаття. Бронюйте свій готель в Тячівському районі вже сьогодні та створіть незабутні спогади!",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/zakarpatska"}
        raion={"/tyachiv-raion"}
        city={""}
        building={"/hotel"}
      />
      <RealtyItems
        firstFilter={[
          { title: "Готелі у Тячівському районі" },
          { raion: "/tyachiv-raion", type: "hotel" },
        ]}
        secondFilter={[
          { title: "Житло у Тячівському районі" },
          { raion: "/tyachiv-raion" },
        ]}
        thirdFilter={[
          { title: "Житло у Закарпатській області" },
          { oblast: "/zakarpatska" },
        ]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Тячівський район — це справжня оаза для любителів активного відпочинку,
        де кожен знайде щось для себе. Тут ви зможете насолодитися гірськими
        походами, велопрогулянками, лижним та сноубордичним спортом, а також
        риболовлею. Цей край пропонує безліч можливостей для занять спортом на
        свіжому повітрі. Неподалік розташовані цілющі джерела, які багаті на
        мінерали, а термальні джерела допоможуть вам оздоровитися і відновити
        сили. Закарпаття також славиться своєю багатою історією та культурою, що
        робить ваше перебування ще більш цікавим. Ви зможете дізнатися більше
        про місцеві звичаї та традиції. Не забудьте скуштувати смачні місцеві
        страви та напої, які здивують вас своїм неповторним смаком. Обираючи
        готель у Тячівському районі, ви отримуєте можливість насолоджуватися
        красою Карпат, активним відпочинком на свіжому повітрі, комфортом і
        затишком, а також незабутніми враженнями, які залишаться з вами на все
        життя.
      </p>
    </RealtyPage>
  );
}
