import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Глемпінги в Карпатах: Ексклюзивний відпочинок в Івано-Франківській області",
  description:
    "Насолоджуйтесь поєднанням природи та комфорту в глемпінгах Івано-Франківської області. Затишні намети з усіма зручностями, розташовані серед мальовничих Карпат, подарують вам унікальний досвід відпочинку на природі.",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/ivano-frankivska"}
        raion={""}
        city={""}
        building={"/glamping"}
      />
      <RealtyItems
        firstFilter={[
          { title: "Глемпінги в Івано-Франківській області" },
          { oblast: "/ivano-frankivska", type: "glamping" },
        ]}
        secondFilter={[
          { title: "Житло у Івано-Франківській області" },
          { oblast: "/ivano-frankivska" },
        ]}
        thirdFilter={[]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Глемпінг у Карпатах – це ідеальний варіант для тих, хто хоче поєднати
        комфорт із красою природи. Івано-Франківська область з її мальовничими
        горами пропонує унікальний досвід відпочинку, де ви можете
        насолоджуватися всіма перевагами сучасного житла, залишаючись на лоні
        природи. У глемпінгу ви будете відчувати себе, як вдома, але при цьому
        прокидатися з видом на гори, слухати спів птахів і насолоджуватися
        свіжим карпатським повітрям. Тут вас чекають зручні ліжка, сучасні ванні
        кімнати, затишні зони для відпочинку та навіть можливість приготувати
        їжу на природі. Глемпінги в Карпатах розташовані в наймальовничіших
        куточках, де природа вражає своєю красою. Ви можете вибрати варіант біля
        гірського струмка або в оточенні густих лісів. Оренда глемпінгу в
        Івано-Франківській області – це чудовий спосіб насолодитися активним
        відпочинком. Піші прогулянки, велосипедні маршрути, гірськолижні траси –
        все це в межах кроку. Крім того, вечори біля вогнища під зоряним небом
        створюють особливу романтичну атмосферу. Глемпінг – це унікальний
        досвід, що поєднує дикість природи з усіма зручностями сучасного життя.
        Завдяки приватності та віддаленості від шуму, ви можете зануритися у
        відпочинок, відновити сили та насолодитися красою Карпат по-справжньому.
      </p>
    </RealtyPage>
  );
}
