import BlogItem from "@/components/BlogPreview/BlogItem/BlogItem";
import BlogPreview from "@/components/BlogPreview/BlogPreview";

export default function BlogPage() {
  return (
    <BlogPreview>
      <BlogItem
        src={"/blog/new-york.jpg"}
        alt={"new york"}
        title={"Прекрасний Ню Йорк"}
        description={
          "Нью-Йорк — це місто, яке ніколи не спить, зі своїм унікальним ритмом життя та неймовірною культурною спадщиною. Тут переплітаються історія та сучасність: від іконічних пам’яток, таких як Статуя Свободи та Емпайр-Стейт-Білдінг, до мистецьких галерей, театрів на Бродвеї та розкішних ресторанів."
        }
      />
      <BlogItem
        src={"/blog/vodopad.jpeg"}
        alt={"new york"}
        title={"Водоспад Шипіт"}
        description={
          "Водоспад Шипіт — одне з наймальовничіших місць у Карпатах, розташоване біля гори Великий Верх. Висота його каскадів сягає 14 метрів, і він зачаровує туристів своєю красою в будь-яку пору року. Особливо вражає навесні, коли тане сніг, та восени, коли ліси довкола набувають яскравих барв."
        }
      />
      <BlogItem
        src={"/blog/venezia.jpg"}
        alt={"Венеція"}
        title={"Неймовірна Венеція"}
        description={
          "Венеція — унікальне місто на воді в Італії, відоме архітектурою, каналами та мостами. Гондоли ковзають по вузьких каналах, а пам’ятки, такі як площа Сан-Марко і Палац дожів, створюють неповторну атмосферу. Це місто романтики та мистецтва, яке зачаровує кожного."
        }
      />
      <BlogItem
        src={"/blog/Synevyr.jpg"}
        alt={"Синевир"}
        title={"Місце спокою - Синевир"}
        description={
          "Озеро Синевир — найбільше та одне з наймальовничіших озер українських Карпат, розташоване на висоті 989 метрів. Воно вражає чистою водою, оточене густими лісами та гірськими вершинами. Синевир часто називають Морським оком, і це популярне місце для туристів, що шукають спокій і натхнення."
        }
      />
      <BlogItem
        src={"/blog/london.jpg"}
        alt={"Лондон"}
        title={"Лондон - столиця королівства"}
        description={
          "Лондон — столиця Великої Британії, одне з найвідоміших міст світу. Він поєднує багату історію з сучасними архітектурними шедеврами. Тут розташовані такі символи, як Біг-Бен, Тауер і Букінгемський палац. Лондон також відомий своїми музеями, театрами та різноманітною культурною сценою."
        }
      />
      <BlogItem
        src={"/blog/zamok.jpg"}
        alt={"Замок"}
        title={"Середньовічний замок"}
        description={
          "Середньовічний замок — це оборонна споруда, що зводилась у Європі між V та XV століттями. Зазвичай замки мали високі стіни, башти, ріви з водою та підйомні мости для захисту від ворогів. Вони служили резиденціями для шляхти і військовими укріпленнями, а також були символами сили та влади власників."
        }
      />
      <BlogItem
        src={"/blog/sobor.jpg"}
        alt={"Собор"}
        title={"Собор Паризької богоматері"}
        description={
          "Собор Паризької Богоматері, або Нотр-Дам, — шедевр готичної архітектури в Парижі, зведений у XII-XIV століттях. Вражає своїми вежами, вітражами та скульптурами. Це важливий релігійний та історичний символ, відомий завдяки роману Віктора Гюго."
        }
      />
      <BlogItem
        src={"/blog/praha.jpg"}
        alt={"Прага"}
        title={"Затишна Прага"}
        description={
          "Прага — столиця Чехії, відома своєю казковою архітектурою та багатою історією. Її Старе місто з вузькими вуличками, собор Святого Віта, Карлів міст та Празький Град приваблюють туристів з усього світу. Прага також славиться своєю культурною спадщиною, театрами, музеями та затишними кав'ярнями."
        }
      />
      <BlogItem
        src={"/blog/everest.jpg"}
        alt={"Уверест"}
        title={"Українці на Евересті"}
        description={
          "Еверест, або Джомолунгма, — найвища вершина світу, розташована в Гімалаях на кордоні Непалу і Китаю. Його висота становить 8 848,86 метрів. Підкорення Евересту є мрією багатьох альпіністів, але шлях на вершину надзвичайно складний через екстремальні погодні умови та ризиковані маршрути."
        }
      />
    </BlogPreview>
  );
}
