import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title: "Готелі у Дрогобицькому районі | Мої Карпати",
  description:
    "Готелі у Дрогобицькому районі – це ваш комфортний притулок у серці Карпат. Тут вас чекають затишні номери, привітний сервіс і можливість насолодитися природною красою. Виберіть ідеальний готель для свого відпочинку та відкрийте для себе численні можливості для активного проведення часу та захоплюючих екскурсій!",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/lvivska"}
        raion={"/drohobych-raion"}
        city={""}
        building={"/hotel"}
      />
      <RealtyItems
        firstFilter={[
          { title: "Готелі у Дрогобицькому районі районі" },
          { raion: "/drohobych-raion", type: "hotel" },
        ]}
        secondFilter={[
          { title: "Житло у Дрогобицькому районі" },
          { raion: "/drohobych-raion" },
        ]}
        thirdFilter={[
          { title: "Житло у Львівській області" },
          { oblast: "/lvivska" },
        ]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Готелі у Дрогобицькому районі – це ваша можливість віднайти спокій у
        горах, де природа і культура зустрічаються у гармонії. У цьому затишному
        куточку Карпат, серед захоплюючих пейзажів, ви знайдете ідеальні місця
        для відпочинку, які перенесуть вас у світ затишку і умиротворення. Кожен
        готель тут – це не просто місце для ночівлі, а справжня оаза комфорту.
        Затишні номери, оформлені в традиційному стилі, створять атмосферу
        домашнього тепла. Привітний персонал зустріне вас усмішкою та зробить
        усе можливе, щоб ваш відпочинок став незабутнім. А вранці, прокинувшись
        під спів птахів, ви зможете насолодитися смачним сніданком, вдивляючись
        у велич гір. Дрогобицький район радує не лише комфортом готелів, а й
        своєю природною красою. Прогулянки мальовничими стежками, велосипедні
        тури в обіймах зелені та екскурсії до історичних пам’яток дарують
        відчуття єдності з природою. Ви зможете відвідати Дрогобицьку ратушу, що
        стала символом історії та культури, і відчути подих часу. Обираючи
        готелі у Дрогобицькому районі, ви отримуєте не лише місце для
        відпочинку, а й можливість зануритися в атмосферу, що дарує спокій та
        натхнення. Це шанс створити незабутні спогади з близькими,
        насолоджуючись красою Карпат і магією кожного моменту, проведеного в
        цьому дивовижному регіоні.
      </p>
    </RealtyPage>
  );
}
