import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title: "Котеджі у Дрогобицькому районі | Мої Карпати",
  description:
    "Котеджі у Дрогобицькому районі – це ваш ключ до комфортного відпочинку в Карпатах. Обирайте зручні та затишні котеджі, що пропонують всі необхідні умови для приємного перебування. Насолоджуйтеся красою природи, активними розвагами та автентичною атмосферою, які зроблять ваш відпочинок незабутнім!",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/lvivska"}
        raion={"/drohobych-raion"}
        city={""}
        building={"/cottage"}
      />
      <RealtyItems
        firstFilter={[
          { title: "Котеджі у Дрогобицькому районі районі" },
          { raion: "/drohobych-raion", type: "cottage" },
        ]}
        secondFilter={[
          { title: "Житло у Дрогобицькому районі" },
          { raion: "/drohobych-raion" },
        ]}
        thirdFilter={[
          { title: "Житло у Львівській області" },
          { oblast: "/lvivska" },
        ]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Котеджі у Дрогобицькому районі – це ваш портал у світ незабутнього
        відпочинку, де поєднуються затишок і чарівність карпатських пейзажів. У
        цьому куточку України природа розкривається в усій своїй красі, даруючи
        мандрівникам відчуття спокою та гармонії. Обираючи котедж, ви
        потрапляєте у світ, де кожен ранок починається з п’янкого аромату
        свіжого повітря, а вечори сповнені магії, коли заходить сонце,
        освітлюючи гори теплими відтінками. Котеджі обладнані всім необхідним
        для комфортного відпочинку, забезпечуючи атмосферу домашнього затишку.
        Сучасні кухні запрошують вас приготувати смачні страви з місцевих
        продуктів, а затишні зони для відпочинку запрошують провести вечори у
        колі друзів чи сім’ї. Дрогобицький район славиться своєю природною
        красою та історичними пам’ятками. Прогулянки мальовничими стежками,
        велосипедні маршрути та екскурсії до старовинних церков дозволяють
        відчути дух цього регіону. Тут ви можете насолоджуватися чистим
        повітрям, слухати спів птахів і занурюватися в роздуми про прості радощі
        життя. Вибираючи котеджі у Дрогобицькому районі, ви отримуєте не просто
        місце для ночівлі, а можливість зануритися в атмосферу, яка живить душу.
        Це ваш шанс створити незабутні спогади в компанії близьких,
        насолоджуючись природою, комфортом і магією карпатського краю.
      </p>
    </RealtyPage>
  );
}
