import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Бази відпочинку в Мукачівському районі: ідеальні місця для відпочинку та розваг | Мої Карпати",
  description:
    "Ласкаво просимо на наш сайт, присвячений базам відпочинку в Мукачівському районі! Тут ви знайдете широкий вибір комфортних і затишних баз, які ідеально підходять для сімейного відпочинку, романтичних подорожей або активного відпочинку з друзями. Наші пропозиції включають всі необхідні зручності, такі як безкоштовний Wi-Fi, ресторани з традиційною кухнею, спа-послуги та багато інших. Відкрийте для себе красу природи Карпат, насолоджуйтесь чистим повітрям і незабутніми краєвидами. З нами ваш відпочинок стане незабутнім!",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/zakarpatska"}
        raion={"/mukachiv-raion"}
        city={""}
        building={"/base"}
      />
      <RealtyItems
        firstFilter={[
          { title: "Бази відпочинку у Мукачівському районі" },
          { raion: "/mukachiv-raion", type: "base" },
        ]}
        secondFilter={[
          { title: "Житло у Мукачівському районі" },
          { raion: "/mukachiv-raion" },
        ]}
        thirdFilter={[
          { title: "Житло у Закарпатській області" },
          { oblast: "/zakarpatska" },
        ]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Мукачівський район — це справжня перлина Закарпаття, яка вабить туристів
        своєю природною красою та багатством культурних традицій. Якщо ви хочете
        втекти від повсякденних клопотів і поринути в атмосферу спокою та
        гармонії, цей регіон пропонує безліч можливостей для відпочинку. Бази
        відпочинку в Мукачівському районі забезпечують чудові умови для різних
        видів відпочинку — від активного до релаксаційного. Цей район з його
        чудовими горами, чистими річками та величезними лісами є ідеальним
        місцем для любителів природи. Я вважаю, що відпочинок у горах — це не
        лише можливість насолодитися красою, але й шанс відновити енергію та
        знайти гармонію з собою. Бази, такі як "Гірська Казка", пропонують не
        тільки комфортне проживання, але й захопливі види, які залишать у вас
        незабутні враження. Але не варто забувати і про активний відпочинок!
        Мукачівський район славиться своїми туристичними маршрутами. Прогулянки
        по лісах або велотури по мальовничих стежках — це ідеальний спосіб
        провести час на свіжому повітрі. Багато баз пропонують організацію
        екскурсій, які дозволять вам відкрити для себе приховані куточки цієї
        прекрасної місцевості. Для сімей з дітьми це також чудове місце.
        Наприклад, "Карпатський Рай" створений із урахуванням потреб родин — тут
        є все необхідне для комфортного відпочинку з малюками. Аніматори, дитячі
        майданчики та спеціальні програми зроблять ваш відпочинок ще яскравішим.
        Зрештою, Мукачівський район — це не лише про комфорт, але й про враження
        та спогади. Якщо ви прагнете емоцій, нових вражень і можливості
        відпочити на природі, бази відпочинку тут не залишать вас байдужими.
        Пам’ятайте, що відпочинок у природі — це інвестиція у ваше здоров'я та
        настрій. Обирайте базу, яка вам до вподоби, і насолоджуйтеся кожним
        моментом цього чудового регіону!
      </p>
    </RealtyPage>
  );
}
