import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Відпочинок у глемпінгах Тячівського району: Екологічно, комфортно, незабутньо | Мої Карпати",
  description:
    "Відкрийте для себе глемпінги у Тячівському районі — ідеальне поєднання комфорту та природи! Наш сайт пропонує найкращі варіанти глемпінгів, де ви зможете насолодитися живописними краєвидами Карпат, затишними умовами проживання та безпосереднім контактом з природою. Ідеально підходить для сімейного відпочинку, романтичних вікендів або активних пригод. Бронюйте свій глемпінг в Тячівському районі вже сьогодні та створюйте незабутні спогади!",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/zakarpatska"}
        raion={"/tyachiv-raion"}
        city={""}
        building={"/glamping"}
      />
      <RealtyItems
        firstFilter={[
          { title: "Глемпінги у Тячівському районі" },
          { raion: "/tyachiv-raion", type: "glamping" },
        ]}
        secondFilter={[
          { title: "Житло у Тячівському районі" },
          { raion: "/tyachiv-raion" },
        ]}
        thirdFilter={[
          { title: "Житло у Закарпатській області" },
          { oblast: "/zakarpatska" },
        ]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Глемпінги в Тячівському районі — це справжній порятунок для тих, хто
        хоче насолодитися природою без компромісів у комфорті. Цей формат
        відпочинку поєднує зручності готелю з романтикою кемпінгу, створюючи
        ідеальні умови для незабутніх вражень. Обираючи глемпінг у Тячівському
        районі, ви отримуєте можливість жити серед прекрасних гір і лісів, не
        відмовляючись від сучасних зручностей. Це місце, де затишні намети та
        дерев'яні будинки стають вашими комфортними притулками, з усім
        необхідним для відпочинку: зручними ліжками, електрикою та навіть
        санвузлом у деяких випадках. Ви зможете прокидатися під щебетання
        птахів, а ввечері насолоджуватися зоряним небом біля вогнища. Вражаючі
        пейзажі Карпат стануть чудовим фоном для вашого відпочинку. Тут ви
        можете зануритися в різноманітні активності: від гірських походів до
        велопрогулянок, від риболовлі до катання на лижах взимку. Тячівський
        район пропонує безліч маршрутів для туристів, тож кожен знайде щось до
        душі. Цей регіон також славиться своєю культурною спадщиною. Під час
        відпочинку ви матимете можливість відвідати місцеві ярмарки, дізнатися
        більше про традиції Закарпаття та спробувати смачні страви. Місцева
        кухня вражає різноманіттям: від домашніх закусок до автентичних страв,
        приготованих за старовинними рецептами. Глемпінг у Тячівському районі —
        це не просто варіант ночівлі. Це можливість знайти гармонію з природою,
        провести час з родиною та друзями, насолодитися простими радощами життя.
        Бронюйте свій глемпінг вже сьогодні та відкривайте нові грані відпочинку
        в карпатських горах, де кожен момент стає частиною вашої незабутньої
        історії!
      </p>
    </RealtyPage>
  );
}
