import FilterRealty from "@/components/Page/RealtyPage/FilterRealty/FilterRealty";
import RealtyItems from "@/components/Page/RealtyPage/RealtyItems/RealtyItems";
import RealtyPage from "@/components/Page/RealtyPage/RealtyPage";
import { Metadata } from "next";

export const metadata: Metadata = {
  title:
    "Комфортне житло у Хустському районі: ваш ідеальний відпочинок у горах | Мої Карпати",
  description:
    "Виберіть затишне житло у Хустському районі Закарпаття. Насолоджуйтеся гірськими пейзажами, місцевою кухнею та активним відпочинком. Забронюйте зараз!",
};

export const revalidate = 0;

export default async function Realty() {
  return (
    <RealtyPage>
      <FilterRealty
        oblast={"/zakarpatska"}
        raion={"/khust-raion"}
        city={""}
        building={""}
      />
      <RealtyItems
        firstFilter={[
          { title: "Нерухомість у Хустському районі" },
          { raion: "/khust-raion" },
        ]}
        secondFilter={[
          { title: "Житло у Закарпатській області" },
          { oblast: "/zakarpatska" },
        ]}
        thirdFilter={[]}
        forthFilter={[]}
        fifthFilter={[{ title: "Все житло в Карпатах" }, { place: "all" }]}
      />
      <p
        style={{
          color: "#2e2e2e",
          textAlign: "justify",
          fontSize: "14px",
          fontWeight: "300",
          lineHeight: "21px",
        }}
      >
        Чому варто зупинитися у Хустському районі? Хустський район, розташований
        у серці Закарпаття, запрошує вас на відпочинок, наповнений природною
        красою та культурними враженнями. Це місце, де поєднуються мальовничі
        пейзажі, багатий історичний спадок та тепла гостинність місцевих
        жителів. Неповторна природа. Цей район славиться своїми природними
        краєвидами: від величних гір до затишних лісових стежок. Якщо ви любите
        активний відпочинок, тут ви знайдете безліч можливостей для піших
        прогулянок, велосипедних поїздок та риболовлі на кристально чистих
        річках. Хустський район – це справжня оаза для тих, хто цінує активний
        відпочинок на природі. Історичні та культурні скарби. Хуст славиться
        своїм історичним спадком. Відвідайте Хустський замок, що розташований на
        вершині пагорба, звідки відкривається захоплюючий вид на навколишні
        території. Місцеві церкви та традиційні будівлі також варті уваги. Кожен
        куточок цього району дихає історією, що робить його унікальним.
        Комфортне житло на будь-який смак. У Хустському районі ви зможете обрати
        з широкого спектру житла: від сучасних готелів до затишних будиночків у
        лісі. Багато з них обладнані всім необхідним для комфортного проживання,
        включаючи кухні, що дозволяє насолоджуватися домашньою їжею під час
        відпочинку. Гастрономічні задоволення. Закарпатська кухня – це ще одна
        причина відвідати цей регіон. Скуштуйте місцеві делікатеси, такі як
        бограч, закарпатські вина та інші традиційні страви, які додадуть
        гастрономічного різноманіття вашій подорожі. Обираючи житло у Хустському
        районі, ви отримуєте можливість насолодитися безтурботним відпочинком
        серед природи, зануритися в історію та культурні традиції регіону, а
        також смакувати смачні місцеві страви. Цей район стане ідеальним місцем
        для вашого наступного незабутнього відпочинку!
      </p>
    </RealtyPage>
  );
}
